gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
/****************************************************************************
 * arch/renesas/src/arm/ra6m5_usbdev.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>
#include <stdint.h>
#include <stdio.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>
#include <nuttx/usb/cdc.h>
#include <nuttx/serial/serial.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "ra6m5_rcc.h"
#include "ra6m5_usbdev.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#if defined(CONFIG_USBHOST) && defined(CONFIG_USBDEV)
#  error "Both USB Host & Device cannot be configured"
#endif

#ifndef  CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

#define RA6M5_NENDPOINTS      (8)
#define EP0                   (0)
#define EP1                   (1)
#define EP2                   (2)
#define EP3                   (3)
#define EP4                   (4)
#define EP5                   (5)
#define EP6                   (6)
#define EP7                   (7)

#define RA6M5_ENDP_BIT(ep)    (1 << (ep))
#define RA6M5_ENDP_ALLSET     0xff

#define RA6M5_MAXPACKET_SHIFT (6)
#define RA6M5_MAXPACKET_SIZE  (1 << (RA6M5_MAXPACKET_SHIFT))
#define RA6M5_MAXPACKET_MASK  (RA6M5_MAXPACKET_SIZE-1)

#define RA6M5_EP0MAXPACKET    RA6M5_MAXPACKET_SIZE

#define REQRECIPIENT_MASK     (USB_REQ_TYPE_MASK | USB_REQ_RECIPIENT_MASK)

/* Debug ********************************************************************/

/* Trace error codes */

#define RA6M5_TRACEERR_ALLOCFAIL         0x0001
#define RA6M5_TRACEERR_ATTACHIRQ         0x0002
#define RA6M5_TRACEERR_BINDFAILED        0x0003
#define RA6M5_TRACEERR_DRIVER            0x0004
#define RA6M5_TRACEERR_DRIVERREGISTERED  0x0005
#define RA6M5_TRACEERR_EPREAD            0x0006
#define RA6M5_TRACEERR_EWRITE            0x0007
#define RA6M5_TRACEERR_INVALIDPARMS      0x0008
#define RA6M5_TRACEERR_NOEP              0x0009
#define RA6M5_TRACEERR_NOTCONFIGURED     0x000a
#define RA6M5_TRACEERR_NULLPACKET        0x000b
#define RA6M5_TRACEERR_NULLREQUEST       0x000c
#define RA6M5_TRACEERR_REQABORTED        0x000d
#define RA6M5_TRACEERR_STALLEDCLRFEATURE 0x000e
#define RA6M5_TRACEERR_STALLEDISPATCH    0x000f
#define RA6M5_TRACEERR_STALLEDGETST      0x0010
#define RA6M5_TRACEERR_STALLEDGETSTEP    0x0011
#define RA6M5_TRACEERR_STALLEDGETSTRECIP 0x0012
#define RA6M5_TRACEERR_STALLEDREQUEST    0x0013
#define RA6M5_TRACEERR_STALLEDSETFEATURE 0x0014
#define RA6M5_TRACEERR_BADGETCONFIG      0x0015
#define RA6M5_TRACEERR_IRQREGISTRATION   0x001a
#define RA6M5_TRACEERR_DISPATCHSTALL     0x001b
#define RA6M5_TRACEERR_INVALIDCTRLREQ    0x001c
#define RA6M5_TRACEERR_BADEPTYPE         0x001d
#define RA6M5_TRACEERR_BADEPNO           0x001e
#define RA6M5_TRACEERR_EPRESERVE         0x001f
#define RA6M5_TRACEERR_BADSETCONFIG      0x0020

/* Trace interrupt codes */

#define RA6M5_TRACEINTID_CLEARFEATURE    0x0001
#define RA6M5_TRACEINTID_CONTROL         0x0002
#define RA6M5_TRACEINTID_DISPATCH        0x0003
#define RA6M5_TRACEINTID_GETENDPOINT     0x0004
#define RA6M5_TRACEINTID_GETIFDEV        0x0005
#define RA6M5_TRACEINTID_GETSETDESC      0x0006
#define RA6M5_TRACEINTID_GETSETIFCONFIG  0x0007
#define RA6M5_TRACEINTID_GETSTATUS       0x0008
#define RA6M5_TRACEINTID_RESUME          0x0009
#define RA6M5_TRACEINTID_SETADDRESS      0x000a
#define RA6M5_TRACEINTID_SETFEATURE      0x000b
#define RA6M5_TRACEINTID_SUSPEND         0x000c
#define RA6M5_TRACEINTID_SYNCHFRAME      0x000d
#define RA6M5_TRACEINTID_TESTMODE        0x000e
#define RA6M5_TRACEINTID_TXFIFOSTALL     0x000f
#define RA6M5_TRACEINTID_GETCONFIG       0x0010
#define RA6M5_TRACEINTID_EPINQEMPTY      0x0011
#define RA6M5_TRACEINTID_EPOUTQEMPTY     0x0012
#define RA6M5_TRACEINTID_NOSTDREQ        0x0013
#define RA6M5_TRACEINTID_SETCONFIG       0x0014
#define RA6M5_TRACEINTID_GETSETIF        0x0015

/* Hardware interface *******************************************************/

/* This driver supports the one interrupt IN, one bulk IN
 * and one bulk OUT endpoint.
 */

/* Hardware dependent sizes and numbers */

#define RA6M5_BULKMAXPACKET     64          /* Bulk endpoint max packet */
#define RA6M5_INTRMAXPACKET     64          /* Interrupt endpoint max packet */

/* Endpoint numbers */

#define RA6M5_EP0                0          /* Control endpoint */
#define RA6M5_EPBULKIN           1          /* Bulk EP for send to host */
#define RA6M5_EPBULKOUT          2          /* Bulk EP for recv to host */
#define RA6M5_EPINTRIN           3          /* Intr EP for host poll */

/* Request queue operations *************************************************/

#define ra6m5_rqempty(ep)       ((ep)->head == NULL)
#define ra6m5_rqpeek(ep)        ((ep)->head)

#  define LSB 0
#  define MSB 1

/****************************************************************************
 * Private Types
 ****************************************************************************/

