gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
static struct usbdev_ep_s *ra6m5_allocep(struct usbdev_s *dev,
                                         uint8_t epno, bool in,
                                         uint8_t eptype);
static void ra6m5_freeep(struct usbdev_s *dev, struct usbdev_ep_s *ep);
static int ra6m5_getframe(struct usbdev_s *dev);
static int ra6m5_wakeup(struct usbdev_s *dev);
static int ra6m5_selfpowered(struct usbdev_s *dev, bool selfpowered);
int ra6m5_pullup(struct usbdev_s *dev, bool enable);

/* Interrupt Handler */

static int ra6m5_usbinterrupt(int irq, void *context, void *arg);

/* USB Helper Functions */

void usb_pstd_attach_process(void);
uint16_t usb_pstd_chk_vbsts(void);
void hw_usb_pclear_dprpu(void);
static void hw_usb_clear_aclrm(uint16_t pipeno);
static void hw_usb_set_aclrm(uint16_t pipeno);
static void usb_cstd_do_aclrm(uint16_t pipe);
static void hw_usb_set_curpipe(uint16_t pipemode, uint16_t pipeno);
static void hw_usb_rmw_fifosel(uint16_t pipemode,
                         uint16_t data, uint16_t bitptn);
static void usb_cstd_chg_curpipe(uint16_t pipe,
                           uint16_t fifosel, uint16_t isel);
static void *hw_usb_get_fifosel_adr(uint16_t pipemode);
static uint16_t hw_usb_read_fifosel(uint16_t pipemode);
static void hw_usb_set_trclr(uint16_t pipeno);
static void hw_usb_clear_trenb(uint16_t pipeno);
static void hw_usb_clear_bempenb(uint16_t pipeno);
static void hw_usb_clear_nrdyenb(uint16_t pipeno);
static void hw_usb_clear_brdyenb(uint16_t pipeno);
static uint16_t hw_usb_read_pipectr(uint16_t pipeno);
static void hw_usb_clear_pid(uint16_t pipeno, uint16_t data);
static void usb_cstd_set_nak(uint16_t pipe);
void usb_pstd_forced_termination(uint16_t pipe, uint16_t status);
void usb_pstd_detach_process(void);
static void usb_cstd_clr_stall(uint16_t pipe);
static void hw_usb_write_pipesel(uint16_t data);
static void hw_usb_write_pipecfg(uint16_t data);
static void hw_usb_write_pipemaxp(uint16_t data);
static void hw_usb_write_pipeperi(uint16_t data);
static void hw_usb_set_sqclr(uint16_t pipeno);
static void hw_usb_clear_sts_brdy(uint16_t pipeno);
static void hw_usb_clear_status_nrdy(uint16_t pipeno);
static void hw_usb_clear_status_bemp(uint16_t pipeno);
void usb_pstd_bus_reset(void);
void usb_pstd_suspend_process(void);
uint16_t usb_cstd_port_speed(void);
static void hw_usb_write_dcpcfg(uint16_t data);
static uint16_t hw_usb_read_dvstctr(void);
static int hw_usb_read_syssts(void);
void usb_pstd_save_request(void);
static void hw_usb_set_pid(uint16_t pipeno, uint16_t data);
static void hw_usb_set_mbw(uint16_t pipemode, uint16_t data);
static uint16_t hw_usb_read_dcpmaxp(void);
static uint16_t hw_usb_read_pipemaxp(void);
static void hw_usb_write_dcpmxps(uint16_t data);
uint16_t usb_pstd_pipe2fport(uint16_t pipe);
static uint16_t usb_cstd_get_pid(uint16_t pipe);
static void usb_cstd_clr_transaction_counter(uint16_t trnreg);
static uint16_t hw_usb_read_pipecfg(void);
void usb_pstd_set_stall(uint16_t pipe);
static uint16_t hw_usb_read_frmnum(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Endpoint methods */

static const struct usbdev_epops_s g_epops =
{
  .configure   = ra6m5_epconfigure,
  .disable     = ra6m5_epdisable,
  .allocreq    = ra6m5_epallocreq,
  .freereq     = ra6m5_epfreereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = ra6m5_epallocbuffer,
  .freebuffer  = ra6m5_epfreebuffer,
#endif
  .submit      = ra6m5_epsubmit,
  .cancel      = ra6m5_epcancel,
};

/* USB controller device methods */

static const struct usbdev_ops_s g_devops =
{
  .allocep     = ra6m5_allocep,
  .freeep      = ra6m5_freeep,
  .getframe    = ra6m5_getframe,
  .wakeup      = ra6m5_wakeup,
  .selfpowered = ra6m5_selfpowered,
  .pullup      = ra6m5_pullup,
};

enum ra6m5_ep0state_e
{
  EP0STATE_WRREQUEST = 0,       /* Write request in progress */
  EP0STATE_RDREQUEST,           /* Read request in progress */
  EP0STATE_STALLED
};

/* There is only one, single, pre-allocated instance
 * of the driver structure
 */

struct ra6m5_usbdev_s g_usbdev;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra6m5_rqdequeue
 *
 * Description:
 *   Remove a request from an endpoint request queue
 *
 ****************************************************************************/

struct ra6m5_req_s *ra6m5_rqdequeue(struct ra6m5_ep_s *privep)
{
  struct ra6m5_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: ra6m5_rqenqueue
 *
 * Description:
 *   Add a request from an endpoint request queue
 *
 ****************************************************************************/

static void ra6m5_rqenqueue(struct ra6m5_ep_s *privep,
                            struct ra6m5_req_s *req)
{
  req->flink = NULL;
  if (!privep->head)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }
}

/****************************************************************************
 * Name: hw_usb_get_fifoctr_adr
 *
 * Description:
 *   Get FIFOCTR Address
 *
 ****************************************************************************/

static void *hw_usb_get_fifoctr_adr(uint16_t pipemode)
{
  void *p_reg = NULL;

  switch (pipemode)
    {
      case USB_CUSE:
        p_reg = (void *)ra6m5_usbdev_getreg_addr(RA6M5_USB_CFIFOCTR_OFFSET);
        break;

      case USB_D0USE:
        p_reg = (void *)ra6m5_usbdev_getreg_addr(RA6M5_USB_D0FIFOCTR_OFFSET);
        break;

      case USB_D1USE:
        p_reg = (void *)ra6m5_usbdev_getreg_addr(RA6M5_USB_D1FIFOCTR_OFFSET);
        break;

      default:
        break;
    }

  return p_reg;
}

/****************************************************************************
 * Name: hw_usb_set_mbw
 *
 * Description:
 *   Set MBW bit
 *
 ****************************************************************************/

