gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  if ((count & (uint16_t)0x0001u) != 0u)
    {
      /* 8bit access */

      /* count == odd */

      /* Change FIFO access width */

      hw_usb_set_mbw(pipemode, USB_MBW_8);

      /* FIFO write */

      hw_usb_write_fifo8(pipemode, *write_p);

      /* Return FIFO access width */

      hw_usb_set_mbw(pipemode, USB_MBW_16);

      /* Renewal write pointer */

      write_p++;
    }

  return write_p;
}

/****************************************************************************
 * Name: hw_usb_set_bval
 *
 * Description:
 *   Set BVAL
 *
 ****************************************************************************/

static void hw_usb_set_bval(uint16_t pipemode)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifoctr_adr(pipemode);

  (*p_reg) |= USB_BVAL;
}

/****************************************************************************
 * Name: usb_pstd_write_data
 *
 * Description:
 *   Write Data
 *
 ****************************************************************************/

uint16_t usb_pstd_write_data(uint16_t pipe, uint16_t pipemode)
{
  uint16_t size;
  uint16_t count;
  uint16_t buf;
  uint16_t mxps;
  uint16_t end_flag;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_ERROR; /* Error */
    }

  /* Changes FIFO port by the pipe. */

  if ((USB_CUSE == pipemode) && (USB_PIPE0 == pipe))
    {
      buf = usb_cstd_is_set_frdy(pipe, (uint16_t)USB_CUSE,
                                 (uint16_t)USB_ISEL);
    }
  else
    {
      buf = usb_cstd_is_set_frdy(pipe, (uint16_t)pipemode, USB_FALSE);
    }

  /* Check error */

  if (USB_ERROR == buf)
    {
      /* FIFO access error */

      buf = usb_cstd_is_set_frdy(pipe, (uint16_t)pipemode, USB_FALSE);
    }

  /* Data buffer size */

  size = usb_cstd_get_buf_size(pipe);

  /* Max Packet Size */

  mxps = usb_cstd_get_maxpacket_size(pipe);

  if (g_usb_pstd_data_cnt[pipe] <= (uint32_t)size)
    {
      count = (uint16_t)g_usb_pstd_data_cnt[pipe];

      /* Data count check */

      if (0 == count)
        {
          /* Null Packet is end of write */

          end_flag = USB_WRITESHRT;
        }

      else if (0 != (count % mxps))
        {
          /* Short Packet is end of write */

          end_flag = USB_WRITESHRT;
        }

      else
        {
          if (USB_PIPE0 == pipe)
            {
              /* Just Send Size */

              end_flag = USB_WRITING;
            }
          else
            {
              /* Write continues */

              end_flag = USB_WRITEEND;
            }
        }
    }
  else
    {
      /* Write continues */

      end_flag = USB_WRITING;
      count = size;
    }

  gp_usb_pstd_data[pipe] = usb_pstd_write_fifo(count, pipemode,
                                               gp_usb_pstd_data[pipe]);

  /* Check data count to remain */

  if (g_usb_pstd_data_cnt[pipe] < (uint32_t)size)
    {
      /* Clear data count */

      g_usb_pstd_data_cnt[pipe] = (uint32_t)0u;

      /* Read CFIFOCTR */

      buf = hw_usb_read_fifoctr(pipemode);

      /* Check BVAL */

      if (0u == (buf & USB_BVAL))
        {
          /* Short Packet */

          hw_usb_set_bval(pipemode);
        }
    }
  else
    {
      /* Total data count - count */

      g_usb_pstd_data_cnt[pipe] -= count;
    }

  /* End or Err or Continue */

  return end_flag;
}

/****************************************************************************
 * Name: hw_usb_set_nrdyenb
 *
 * Description:
 *   Set NRDYENB
 *
 ****************************************************************************/

static void hw_usb_set_nrdyenb(uint16_t pipeno)
{
  uint16_t regval;
  regval = ra6m5_usbdev_getreg16(RA6M5_USB_NRDYENB_OFFSET);
  regval |= (1 << pipeno);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_NRDYENB_OFFSET);
}

/****************************************************************************
 * Name: usb_cstd_nrdy_enable
 *
 * Description:
 *   NRDY Enable
 *
 ****************************************************************************/

static void usb_cstd_nrdy_enable(uint16_t pipe)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Enable NRDY */

  hw_usb_set_nrdyenb(pipe);
}

/****************************************************************************
 * Name: usb_cstd_set_buf
 *
 * Description:
 *   Set Buf
 *
 ****************************************************************************/

static void usb_cstd_set_buf(uint16_t pipe)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* PIPE control reg set */

  hw_usb_set_pid(pipe, USB_PID_BUF);
}

/****************************************************************************
 * Name: hw_usb_set_bempenb
 *
 * Description:
 *   Set BEMPENB
 *
 ****************************************************************************/

static void hw_usb_set_bempenb(uint16_t pipeno)
{
  uint16_t regval;
  regval = ra6m5_usbdev_getreg16(RA6M5_USB_BEMPENB_OFFSET);
  regval |= (1 << pipeno);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_BEMPENB_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_set_brdyenb
 *
 * Description:
 *   Set BRDYENB
 *
 ****************************************************************************/

static void hw_usb_set_brdyenb(uint16_t pipeno)
{
  uint16_t regval;
  regval = ra6m5_usbdev_getreg16(RA6M5_USB_BRDYENB_OFFSET);
  regval |= (1 << pipeno);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_BRDYENB_OFFSET);
}

/****************************************************************************
 * Name: usb_pstd_ctrl_write
 *
 * Description:
 *   CTRL Write
 *
 ****************************************************************************/

void usb_pstd_ctrl_write(uint32_t bsize, uint8_t *table)
{
  g_usb_pstd_data_cnt[USB_PIPE0] = bsize;
  gp_usb_pstd_data[USB_PIPE0] = table;

  usb_cstd_chg_curpipe((uint16_t) USB_PIPE0,
                       (uint16_t) USB_CUSE, USB_FALSE);

  /* Buffer clear */

  hw_usb_set_bclr(USB_CUSE);

  /* Interrupt enable */

  /* Enable ready interrupt */

