gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  hw_usb_set_brdyenb((uint16_t) USB_PIPE0);

  /* Enable not ready interrupt */

  usb_cstd_nrdy_enable((uint16_t) USB_PIPE0);

  /* Set PID=BUF */

  usb_cstd_set_buf((uint16_t) USB_PIPE0);
}

/****************************************************************************
 * Name: usb_ctrl_read
 *
 * Description:
 *   CTRL Read
 *
 ****************************************************************************/

uint16_t usb_ctrl_read(uint32_t bsize, uint8_t *table)
{
  usb_pstd_ctrl_write(bsize, table);
  return OK;
}

/****************************************************************************
 * Name: usb_pstd_ctrl_read
 *
 * Description:
 *   CTRL Read invoked from class driver
 *
 ****************************************************************************/

uint16_t usb_pstd_ctrl_read(uint32_t bsize, uint8_t *table)
{
  uint16_t end_flag;
  g_usb_pstd_data_cnt[USB_PIPE0] = bsize;
  gp_usb_pstd_data[USB_PIPE0] = table;
  usb_cstd_chg_curpipe((uint16_t) USB_PIPE0, (uint16_t) USB_CUSE,
                       (uint16_t) USB_ISEL);

  /* Buffer clear */

  hw_usb_set_bclr(USB_CUSE);

  hw_usb_clear_status_bemp(USB_PIPE0);

  /* Peripheral Control sequence */

  end_flag = usb_pstd_write_data(USB_PIPE0, USB_CUSE);

  /* Peripheral control sequence */

  switch (end_flag)
    {
        /* End of data write */

      case USB_WRITESHRT :

        /* Enable not ready interrupt */

        usb_cstd_nrdy_enable((uint16_t) USB_PIPE0);

        /* Set PID=BUF */

        usb_cstd_set_buf((uint16_t) USB_PIPE0);
        break;

        /* End of data write (not null) */

      case USB_WRITEEND :

        /* Continue */

        /* Continue of data write */

      case USB_WRITING :

        /* Enable empty interrupt */

        hw_usb_set_bempenb((uint16_t) USB_PIPE0);

        /* Enable not ready interrupt */

        usb_cstd_nrdy_enable((uint16_t) USB_PIPE0);

        /* Set PID=BUF */

        usb_cstd_set_buf((uint16_t) USB_PIPE0);
        break;

        /* FIFO access error */

      case USB_ERROR :
        break;

      default :
        break;
    }

  return end_flag; /* End or error or continue */
}

/****************************************************************************
 * Name: usb_pstd_buf_to_fifo
 *
 * Description:
 *   Buf to FIFO data write
 *
 ****************************************************************************/

void usb_pstd_buf_to_fifo(uint16_t pipe, uint16_t useport)
{
  uint16_t end_flag;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Disable Ready Interrupt */

  hw_usb_clear_brdyenb(pipe);
  hw_usb_clear_bempenb(pipe);

  end_flag = usb_pstd_write_data(pipe, useport);

  /* Check FIFO access sequence */

  switch (end_flag)
    {
      case USB_WRITING:

        /* Continue of data write */

        /* Enable Ready Interrupt */

        hw_usb_set_brdyenb(pipe);

        /* Enable Not Ready Interrupt */

        usb_cstd_nrdy_enable(pipe);
        break;

      case USB_WRITEEND:

        /* End of data write */

        /* continue */

      case USB_WRITESHRT:

        /* End of data write */

        /* Enable Empty Interrupt */

        hw_usb_set_bempenb(pipe);

        /* Enable Not Ready Interrupt */

        usb_cstd_nrdy_enable(pipe);
        break;

      case USB_ERROR:

        /* FIFO access error */

        usb_pstd_forced_termination(pipe, (uint16_t)USB_DATA_ERR);
        break;

      default:
        usb_pstd_forced_termination(pipe, (uint16_t)USB_DATA_ERR);
        break;
    }
}

/****************************************************************************
 * Name: usb_pstd_data_end
 *
 * Description:
 *   Data End transfer
 *
 ****************************************************************************/

void usb_pstd_data_end(uint16_t pipe, uint16_t status)
{
  uint16_t useport;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* PID = NAK */

  /* Set NAK */

  usb_cstd_set_nak(pipe);

  /* Pipe number to FIFO port select */

  useport = USB_CUSE;

  /* Disable Interrupt */

  /* Disable Ready Interrupt */

  hw_usb_clear_brdyenb(pipe);

  /* Disable Not Ready Interrupt */

  hw_usb_clear_nrdyenb(pipe);

  /* Disable Empty Interrupt */

  hw_usb_clear_bempenb(pipe);

  /* Disable Transaction count */

  usb_cstd_clr_transaction_counter(pipe);

  /* Check use FIFO */

  switch (useport)
    {
      /* CFIFO use */

      case USB_CUSE:
        break;

      default:
        break;
    }
}

/****************************************************************************
 * Name: usb_pstd_send_start
 *
 * Description:
 *   Send start
 *
 ****************************************************************************/

void usb_pstd_send_start(uint16_t pipe, uint8_t *buf, uint32_t size)
{
  uint16_t useport;

  /* Select NAK */

  usb_cstd_set_nak(pipe);

  /* Set data count */

  g_usb_pstd_data_cnt[pipe] = size;

  /* Set data pointer */

  gp_usb_pstd_data[pipe] = buf;

  /* BEMP Status Clear */

  hw_usb_clear_status_bemp(pipe);

  /* BRDY Status Clear */

  hw_usb_clear_sts_brdy(pipe);

  /* Pipe number to FIFO port select */

  useport = USB_CUSE;

  usb_cstd_chg_curpipe(pipe, useport, USB_FALSE);

  /* Buffer to FIFO data write */

  usb_pstd_buf_to_fifo(pipe, useport);

  /* Set BUF */

  usb_cstd_set_buf(pipe);
}

/****************************************************************************
 * Name: hw_usb_read_pipecfg
 *
 * Description:
 *   Read Pipecfg
 *
 ****************************************************************************/

static uint16_t hw_usb_read_pipecfg(void)
{
  return ra6m5_usbdev_getreg16(RA6M5_USB_PIPECFG_OFFSET);
}

/****************************************************************************
 * Name: usb_cstd_get_pipe_dir
 *
 * Description:
 *   Get pipe direction
 *
 ****************************************************************************/

static uint16_t usb_cstd_get_pipe_dir(uint16_t pipe)
{
  uint16_t buf;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_NULL; /* Error */
    }

