gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  /* Pipe select */

  hw_usb_write_pipesel(pipe);

  /* Read Pipe direction */

  buf = hw_usb_read_pipecfg();
  return (uint16_t)(buf & USB_DIRFIELD);
}

/****************************************************************************
 * Name: usb_cstd_get_pipe_type
 *
 * Description:
 *   Get pipe type
 *
 ****************************************************************************/

static uint16_t usb_cstd_get_pipe_type(uint16_t pipe)
{
  uint16_t buf;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_NULL; /* Error */
    }

  /* Pipe select */

  hw_usb_write_pipesel(pipe);

  /* Read Pipe direction */

  buf = hw_usb_read_pipecfg();
  return (uint16_t)(buf & USB_TYPFIELD);
}

/****************************************************************************
 * Name: usb_pstd_chk_configured
 *
 * Description:
 *   Check Configured
 *
 ****************************************************************************/

uint16_t usb_pstd_chk_configured(void)
{
  uint16_t buf;

  buf = ra6m5_usbdev_getreg16(RA6M5_USB_INTSTS0_OFFSET);

  /* Device Status - Configured check */

  if (USB_DS_CNFG == (buf & USB_DVSQ))
    {
      /* Configured */

      return USB_TRUE;
    }
  else
    {
      /* not Configured */

      return USB_FALSE;
    }
}

/****************************************************************************
 * Name: hw_usb_set_trenb
 *
 * Description:
 *   Set TRENB
 *
 ****************************************************************************/

static void hw_usb_set_trenb(uint16_t pipeno)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1TRE_OFFSET + ((pipeno - 1) * 4));

  (*p_reg) |= USB_TRENB;
}

/****************************************************************************
 * Name: hw_usb_write_pipetrn
 *
 * Description:
 *   Write to PIPETRN
 *
 ****************************************************************************/

static void hw_usb_write_pipetrn(uint16_t pipeno, uint16_t data)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1TRN_OFFSET + ((pipeno - 1) * 4));

  *p_reg = data;
}

/****************************************************************************
 * Name: usb_cstd_set_transaction_counter
 *
 * Description:
 *   Set transaction counter
 *
 ****************************************************************************/

static void usb_cstd_set_transaction_counter(uint16_t trnreg,
                                             uint16_t trncnt)
{
  hw_usb_set_trclr(trnreg);
  hw_usb_write_pipetrn(trnreg, trncnt);
  hw_usb_set_trenb(trnreg);
}

/****************************************************************************
 * Name: usb_pstd_receive_start
 *
 * Description:
 *   Receive start
 *
 ****************************************************************************/

void usb_pstd_receive_start(uint16_t pipe)
{
  struct usb_utr *pp;
  uint32_t length;
  uint16_t mxps;
  uint16_t useport;

  /* Evacuation pointer */

  pp = g_p_usb_pstd_pipe[pipe];
  length = pp->tranlen;

  /* Select NAK */

  usb_cstd_set_nak(pipe);

  /* Set data pointer */

  gp_usb_pstd_data[pipe] = (uint8_t *)pp->p_tranadr;

  /* Pipe number to FIFO port select */

  useport = USB_CUSE;

  /* Check use FIFO access */

  switch (useport)
    {
        /* CFIFO use */

      case USB_CUSE:

        /* Changes the FIFO port by the pipe. */

        usb_cstd_chg_curpipe(pipe, useport, USB_FALSE);

        /* Max Packet Size */

        mxps = usb_cstd_get_maxpacket_size(pipe);
        if ((uint32_t)0u != length)
          {
             /* Data length check */

             if ((uint32_t)0u == (length % mxps))
               {
                 /* Set Transaction counter */

                 usb_cstd_set_transaction_counter(pipe, (uint16_t)(length /
                                                  mxps));
               }
             else
              {
                /* Set Transaction counter */

                usb_cstd_set_transaction_counter(pipe, (uint16_t)((length
                                                / mxps) + (uint32_t)1u));
              }
          }

        /* Set BUF */

        usb_cstd_set_buf(pipe);

        /* Enable Ready Interrupt */

        hw_usb_set_brdyenb(pipe);

        /* Enable Not Ready Interrupt */

        usb_cstd_nrdy_enable(pipe);
        break;

      default:
        usb_pstd_forced_termination(pipe, (uint16_t)USB_DATA_ERR);
        break;
    }
}

/****************************************************************************
 * Name: usb_pstd_set_submitutr
 *
 * Description:
 *   Set Submit Request
 *
 ****************************************************************************/

void usb_pstd_set_submitutr(struct usb_utr *utrmsg)
{
  uint16_t pipenum;

  pipenum = utrmsg->keyword;
  g_p_usb_pstd_pipe[pipenum] = utrmsg;

  /* Check state (Configured) */

  if (USB_TRUE == usb_pstd_chk_configured())
    {
      if (USB_DIR_P_OUT == usb_cstd_get_pipe_dir(pipenum))
        {
          usb_pstd_receive_start(pipenum);    /* Out transfer */
        }
      else
        {
          /* In transfer */

          usb_pstd_send_start(pipenum, NULL, 0);
        }
    }
}

/****************************************************************************
 * Name: usb_pstd_transfer_start
 *
 * Description:
 *   Transfer start
 *
 ****************************************************************************/

uint8_t usb_pstd_transfer_start(struct usb_utr *ptr)
{
  usb_pstd_set_submitutr(ptr);
  return OK;
}

/****************************************************************************
 * Name: usb_data_write
 *
 * Description:
 *   Data write
 *
 ****************************************************************************/

long usb_data_write(uint8_t epno, uint8_t *buf, uint32_t size)
{
  uint8_t pipe;
  if (epno == BULK_IN_EPNUM)
    {
      pipe = BULK_IN_PIPE;
    }
  else if (epno == INT_IN_EPNUM)
    {
      pipe = INT_IN_PIPE;
    }

  if (USB_TRUE == usb_pstd_chk_configured())
    {
      if (USB_DIR_P_OUT == usb_cstd_get_pipe_dir(pipe))
        {
          usb_pstd_receive_start(pipe);    /* Out transfer */
        }
      else
        {
          /* In transfer */

          usb_pstd_send_start(pipe, buf, size);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: usb_data_read
 *
 * Description:
 *   Data read
 *
 ****************************************************************************/

void usb_data_read(uint8_t *buf, uint32_t size)
{
  uint8_t pipe = BULK_OUT_PIPE;
  struct usb_utr *p_tran_data;
  memset((void *)&g_usb_pdata, 0, ((USB_MAX_PIPE_NO + 1) *
         sizeof(struct usb_utr)));
  p_tran_data = (struct usb_utr *)&g_usb_pdata[pipe];
  p_tran_data->p_tranadr = buf; /* Data address */
  p_tran_data->tranlen = size;  /* Data Size */
  p_tran_data->keyword = pipe;
  usb_pstd_transfer_start(p_tran_data);
}

/****************************************************************************
 * Name: ra6m5_epwrite
 *
 * Description:
 *   Endpoint write (IN)
 *
 ****************************************************************************/

static void ra6m5_epwrite(uint8_t epno, struct ra6m5_usbdev_s *priv,
                          struct ra6m5_ep_s *privep, uint8_t *buf,
                          uint32_t nbytes)
{
  uint8_t type;
  uint8_t g_buf[RA6M5_MAXPACKET_SIZE];
  type = MSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBREQ_OFFSET));

  if (epno == 0)
    {
      if ((type & USB_REQ_TYPE_MASK) != USB_REQ_TYPE_STANDARD)
        {
          if (type == ACM_GET_LINE_CODING)
            {
              usb_pstd_ctrl_read(nbytes, buf);
              usb_cstd_set_buf((uint16_t)USB_PIPE0);
              usb_data_read(g_buf, RA6M5_MAXPACKET_SIZE);
            }
          else
            {
              usb_pstd_ctrl_read(nbytes, buf);
              usb_cstd_set_buf((uint16_t)USB_PIPE0);
            }
        }
      else
        {
          usb_pstd_ctrl_read(nbytes, buf);
          usb_cstd_set_buf((uint16_t)USB_PIPE0);
        }
    }

  if (epno > 0)
    {
      usb_data_write(epno, buf, nbytes);
    }
}

/****************************************************************************
 * Name: ra6m5_epread
 *
 * Description:
 *   Endpoint read (OUT)
 *
 ****************************************************************************/

static int ra6m5_epread(uint8_t epno, struct ra6m5_usbdev_s *priv,
                        uint8_t *buf, uint16_t nbytes)
{
  if (epno == EP0)
    {
      usb_ctrl_read(CDC_CLASS_DATA_LENGTH, buf);
    }
  else
    {
      usb_data_read(buf, nbytes);
      if (bytesread != 0)
        {
          return bytesread;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: ra6m5_abortrequest
 *
 * Description:
 *   Discard a request
 *
 ****************************************************************************/

static inline void ra6m5_abortrequest(struct ra6m5_ep_s *privep,
                                      struct ra6m5_req_s *privreq,
                                      int16_t result)
{
  usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_REQABORTED),
           (uint16_t)USB_EPNO(privep->ep.eplog));

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);
}

/****************************************************************************
 * Name: ra6m5_reqcomplete
 *
 * Description:
 *   Handle termination of a request.
 *
 ****************************************************************************/

