gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
static void ra6m5_reqcomplete(struct ra6m5_ep_s *privep, int16_t result)
{
  struct ra6m5_req_s *privreq;
  irqstate_t flags;

  /* Remove the completed request at the head of the endpoint request list */

  flags = enter_critical_section();
  privreq = ra6m5_rqdequeue(privep);
  leave_critical_section(flags);

  if (privreq)
    {
      /* If endpoint 0, temporarily reflect the state of protocol stalled
       * in the callback.
       */

      bool stalled = privep->stalled;
      if (USB_EPNO(privep->ep.eplog) == EP0)
        {
          privep->stalled = privep->dev->stalled;
        }

      /* Save the result in the request structure */

      privreq->req.result = result;

      /* Callback to the request completion handler */

      privreq->flink = NULL;
      privreq->req.callback(&privep->ep, &privreq->req);

      /* Restore the stalled indication */

      privep->stalled = stalled;
    }
}

/****************************************************************************
 * Name: ra6m5_wrrequest
 *
 * Description:
 *   Send from the next queued write request
 *
 * Returned Value:
 *  0:not finished; 1:completed; <0:error
 *
 ****************************************************************************/

static int ra6m5_wrrequest(uint8_t epno, struct ra6m5_usbdev_s *priv,
                           struct ra6m5_ep_s *privep)
{
  struct ra6m5_req_s *privreq;
  uint8_t *buf = NULL;
  int nbytes;
  int bytesleft;

  /* We get here when an IN endpoint interrupt occurs.  So now we know that
   * there is no TX transfer in progress.
   */

  privep->txbusy = false;

  /* Check the request from the head of the endpoint request queue */

  privreq = ra6m5_rqpeek(privep);
  if (!privreq)
    {
      /* There is no TX transfer in progress and no new pending TX
       * requests to send.
       */

      usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_EPINQEMPTY), 0);
      return -ENOENT;
    }

  epno = USB_EPNO(privep->ep.eplog);
  uinfo("epno=%d req=%p: len=%d xfrd=%d nullpkt=%d\n",
        epno, privreq, privreq->req.len, privreq->req.xfrd,
        privep->txnullpkt);

  /* Get the number of bytes left to be sent in the packet */

  for (; ; )
    {
      bytesleft = privreq->req.len - privreq->req.xfrd;
      nbytes    = bytesleft;

      /* Either (1) we are committed to sending the null packet
       * (because txnullpkt == 1 && nbytes == 0), or
       * (2) we have not yet send the last packet (nbytes > 0).
       * In either case, it is appropriate to clearn txnullpkt now.
       */

      privep->txnullpkt = 0;

      /* If we are not sending a NULL packet, then clip the size
       * to maxpacket
       * and check if we need to send a following NULL packet.
       */

      if (nbytes > 0)
        {
          /* Either send the maxpacketsize or all of the
           * remaining data in request
           */

          if (nbytes >= privep->ep.maxpacket)
            {
              nbytes =  privep->ep.maxpacket;

              /* Handle the case where this packet is exactly the
               * maxpacketsize.  Do we need to send a zero-length packet
               * in this case?
               */

              if (bytesleft ==  privep->ep.maxpacket &&
                  (privreq->req.flags & USBDEV_REQFLAGS_NULLPKT) != 0)
                {
                  privep->txnullpkt = 1;
                }
            }
        }

      /* Send the packet (might be a null packet nbytes == 0) */

      buf = privreq->req.buf + privreq->req.xfrd;

      ra6m5_epwrite(epno, priv, privep, buf, nbytes);

      /* Update for the next data IN interrupt */

      privreq->req.xfrd += nbytes;
      bytesleft          = privreq->req.len - privreq->req.xfrd;

      /* If all of the bytes were sent (including any final null packet)
       * then we are finished with the request buffer).
       */

      if (bytesleft == 0)
        {
          /* Return the write request to the class driver */

          usbtrace(TRACE_COMPLETE(USB_EPNO(privep->ep.eplog)),
                   privreq->req.xfrd);
          privep->txnullpkt = 0;
          ra6m5_reqcomplete(privep, OK);
          return OK;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: ra6m5_rdrequest
 *
 * Description:
 *   Receive to the next queued read request
 *
 ****************************************************************************/

static int ra6m5_rdrequest(uint8_t epno, struct ra6m5_usbdev_s *priv,
                           struct ra6m5_ep_s *privep)
{
  struct ra6m5_req_s *privreq;
  uint8_t *buf;
  int nbytesread;

  /* Check the request from the head of the endpoint request queue */

  privreq = ra6m5_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_EPOUTQEMPTY), 0);
      return OK;
    }

  uinfo("len=%d xfrd=%d nullpkt=%d\n",
        privreq->req.len, privreq->req.xfrd, privep->txnullpkt);

  usbtrace(TRACE_READ(privep->epphy), privreq->req.xfrd);

  /* Receive the next packet */

  buf        = privreq->req.buf + privreq->req.xfrd;
  nbytesread = ra6m5_epread(epno, priv, buf, privep->ep.maxpacket);
  if (nbytesread < 0)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_EPREAD), nbytesread);
      return ERROR;
    }

  /* If the receive buffer is full or if the last packet was not full
   * then we are finished with the transfer.
   */

  privreq->req.xfrd += nbytesread;
  if (privreq->req.xfrd >= privreq->req.len ||
      nbytesread < privep->ep.maxpacket)
    {
      usbtrace(TRACE_COMPLETE(privep->epphy), privreq->req.xfrd);
      ra6m5_reqcomplete(privep, OK);
    }

  return OK;
}

/****************************************************************************
 * Name: ra6m5_dispatchrequest
 *
 * Description:
 *   Provide unhandled setup actions to the class driver
 *
 ****************************************************************************/

static void ra6m5_dispatchrequest(struct ra6m5_usbdev_s *priv)
{
  int ret;

  usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_DISPATCH), 0);
  if (priv && priv->driver)
    {
      /* Forward to the control request to the class driver implementation */

      ret = CLASS_SETUP(priv->driver, &priv->usbdev, &priv->ctrl,
                        NULL, 0);
      if (ret < 0)
        {
          /* Stall on failure */

          usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_DISPATCHSTALL), 0);
          priv->stalled = 1;
        }
    }
}

/****************************************************************************
 * Name: usb_pstd_get_current_power
 *
 * Description:
 *   Get the power type
 *
 ****************************************************************************/

uint8_t usb_pstd_get_current_power(void)
{
  uint8_t currentpower;

#ifdef CONFIG_USBDEV_SELFPOWERED
  currentpower = USB_GS_SELFPOWERD;
#else
  currentpower = USB_GS_BUSPOWERD;
#endif

