gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  return currentpower;
}

/****************************************************************************
 * Name: usb_pstd_epadr2pipe
 *
 * Description:
 *   Get the endpoint addr to pipe number
 *
 ****************************************************************************/

uint16_t usb_pstd_epadr2pipe(uint16_t dir_ep)
{
  uint16_t i;
  uint16_t direp;
  uint16_t tmp;

  /* Peripheral */

  /* Get PIPE Number from Endpoint address */

  direp = (uint16_t)(((dir_ep & 0x80) >> 3) | (dir_ep & 0x0f));

  /* EP table loop */

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i < (USB_MAX_PIPE_NO + 1); i++)
    {
      /* PIPECFG register will be set if PIPESEL register is set first */

      /* Check if PIPESEL register is set before reading PIPECFG */

      tmp = (ra6m5_usbdev_getreg16(RA6M5_USB_PIPECFG_OFFSET)) &
            (USB_DIRFIELD | USB_EPNUMFIELD);

      /* EP table endpoint dir check */

      if (direp == tmp)
        {
          return i;
        }
    }

  return USB_ERROR;
}

/****************************************************************************
 * Name: hw_usb_read_dcpctr
 *
 * Description:
 *   Read DCPCTR register
 *
 ****************************************************************************/

uint16_t hw_usb_read_dcpctr(void)
{
  return ra6m5_usbdev_getreg16(RA6M5_USB_DCPCTR_OFFSET);
}

/****************************************************************************
 * Name: usb_pstd_set_stall_pipe0
 *
 * Description:
 *   Set stall pipe
 *
 ****************************************************************************/

void usb_pstd_set_stall_pipe0(void)
{
  /* PIPE control reg set */

  hw_usb_set_pid(USB_PIPE0, USB_PID_STALL);
}

/****************************************************************************
 * Name: ra6m5_ep0setup
 *
 * Description:
 *   USB Ctrl EP Setup Event
 *
 ****************************************************************************/

void ra6m5_ep0setup(struct ra6m5_usbdev_s *priv)
{
  struct ra6m5_ep_s   *ep0     = &priv->eplist[EP0];
  struct ra6m5_req_s  *privreq = ra6m5_rqpeek(ep0);
  union wb_u           value;
  union wb_u           index;
  union wb_u           len;
  uint8_t              epno;
  uint8_t tbl[2];
  uint16_t ep;
  uint16_t buf;
  uint16_t pipe;

  /* Starting a control request? */

  if (priv->usbdev.speed == USB_SPEED_UNKNOWN)
    {
      priv->usbdev.speed = USB_SPEED_FULL;
    }

  /* Terminate any pending requests */

  while (!ra6m5_rqempty(ep0))
    {
      int16_t result = OK;
      if (privreq->req.xfrd != privreq->req.len)
        {
          result = -EPROTO;
        }

      usbtrace(TRACE_COMPLETE(ep0->epphy), privreq->req.xfrd);
      ra6m5_reqcomplete(ep0, result);
    }

  /* Assume NOT stalled */

  ep0->stalled  = 0;
  priv->stalled = 0;

  /* And extract the little-endian 16-bit values to host order */

  priv->ctrl.type = LSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBREQ_OFFSET));
  priv->ctrl.req  = MSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBREQ_OFFSET));
  priv->ctrl.value[0] = LSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBVAL_OFFSET));
  priv->ctrl.value[1] =  MSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBVAL_OFFSET));
  priv->ctrl.index[0] = LSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBINDX_OFFSET));
  priv->ctrl.index[1]  = MSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBINDX_OFFSET));
  priv->ctrl.len[0] =  LSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBLENG_OFFSET));
  priv->ctrl.len[1]  = MSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBLENG_OFFSET));

  uinfo("SETUP: type=%02x req=%02x value[0]=%02x value[1] =%02x \
        index[0]=%02x index[1] =%02x len[0]=%02x len[1]=%02x\n",
        priv->ctrl.type, priv->ctrl.req, priv->ctrl.value[0],
        priv->ctrl.value[1], priv->ctrl.index[0],
        priv->ctrl.index[1], priv->ctrl.len[0],
        priv->ctrl.len[1]);

  /* And extract the little-endian 16-bit values to host order */

  value.w = GETUINT16(priv->ctrl.value);
  index.w = GETUINT16(priv->ctrl.index);
  len.w   = GETUINT16(priv->ctrl.len);

  uinfo("value=%x index=%x len=%x\n", value.w, index.w, len.w);

  /* Dispatch any non-standard requests */

  if ((priv->ctrl.type & USB_REQ_TYPE_MASK) != USB_REQ_TYPE_STANDARD)
    {
      usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_NOSTDREQ), priv->ctrl.type);

      /* Let the class implementation handle all non-standar requests */

      priv->ctrl.req = MSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBREQ_OFFSET));
      priv->ctrl.type = LSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBREQ_OFFSET));

      if (priv->ctrl.req == ACM_SET_LINE_CODING ||
          priv->ctrl.req == ACM_SET_CTRL_LINE_STATE)
        {
           priv->ep0state = EP0STATE_RDREQUEST;
           ra6m5_dispatchrequest(priv);
        }

     priv->ep0state = EP0STATE_WRREQUEST;
     ra6m5_dispatchrequest(priv);
    }

  /* Handle standard request.  Pick off the things of interest to the
   * USB device controller driver; pass what is left to the class driver
   */

  switch (priv->ctrl.req)
    {
      case USB_REQ_GETSTATUS:
        {
          /* type:  device-to-host; recipient = device, interface, endpoint
           * value: 0
           * index: zero interface endpoint
           * len:   2; data = status
           */

          if ((0 == value.w) && (2 == len.w))
            {
              tbl[0] = 0;
              tbl[1] = 0;

              /* Check request type */

              switch (priv->ctrl.type & USB_REQ_RECIPIENT_MASK)
                {
                  case USB_REQ_RECIPIENT_ENDPOINT:
                    {
                      /* Endpoint number */

                      ep = (uint16_t)(index.w & USB_EPNUMFIELD);

                      /* Endpoint 0 */

                      if (0 == ep)
                        {
                          buf = hw_usb_read_dcpctr();
                          if ((uint16_t)0 != (buf & USB_PID_STALL))
                            {
                              /* Halt set */

                              tbl[0] = USB_GS_HALT;
                            }

                          /* Control read start */

                          usb_pstd_ctrl_read((uint32_t)2, tbl);
                        }

                      /* EP1 to max */

                      else if (ep <= USB_MAX_EP_NO)
                        {
                          if (USB_TRUE == usb_pstd_chk_configured())
                            {
                              pipe =
                                  usb_pstd_epadr2pipe(g_usb_pstd_req_index);
                              if (USB_ERROR == pipe)
                                {
                                  /* Set pipe USB_PID_STALL */

                                  usb_pstd_set_stall_pipe0();
                                }
                              else
                                {
                                  buf = usb_cstd_get_pid(pipe);
                                  if ((uint16_t)0 != (buf & USB_PID_STALL))
                                    {
                                      /* Halt set */

