gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
                                      tbl[0] = USB_GS_HALT;
                                    }

                                  /* Control read start */

                                  usb_pstd_ctrl_read((uint32_t)2, tbl);
                                }
                            }
                          else
                            {
                              /* Set pipe USB_PID_STALL */

                              usb_pstd_set_stall_pipe0();
                            }
                        }
                      else
                        {
                          /* Set pipe USB_PID_STALL */

                          usb_pstd_set_stall_pipe0();
                        }
                        break;

                      case USB_REQ_RECIPIENT_DEVICE:
                        {
                          if (0 == index.w)
                            {
                              /* Self powered / Bus powered */

                              tbl[0] = usb_pstd_get_current_power();

                              /* Support remote wakeup ? */

                              if (USB_TRUE == g_usb_pstd_remote_wakeup)
                                {
                                  tbl[0] |= USB_GS_REMOTEWAKEUP;
                                }

                              /* Control read start */

                              usb_pstd_ctrl_read((uint32_t)2, tbl);
                            }
                          else
                            {
                              /* Request error */

                              usb_pstd_set_stall_pipe0();
                            }
                        }
                        break;

                      case USB_REQ_RECIPIENT_INTERFACE:
                        {
                          if (USB_TRUE == usb_pstd_chk_configured())
                            {
                              /* 2 is number of interfaces,
                               * as configured by class driver
                               */

                              if (g_usb_pstd_req_index < 2)

                                {
                                  /* Control read start */

                                  usb_pstd_ctrl_read((uint32_t)2, tbl);
                                }
                              else
                                {
                                  /* Request error (not exist interface) */

                                  usb_pstd_set_stall_pipe0();
                                }
                            }
                          else
                            {
                              /* Request error */

                              usb_pstd_set_stall_pipe0();
                            }
                        }
                        break;

                      default:
                        {
                          usb_pstd_set_stall_pipe0();
                        }
                        break;
                    }
                }
            }
        }
        break;
      case USB_REQ_CLEARFEATURE:
        {
          /* type:  host-to-device; recipient = device, interface or endpoint
           * value: feature selector
           * index: zero interface endpoint;
           * len:   zero, data = none
           */

          usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_CLEARFEATURE),
                   priv->ctrl.type);
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) !=
              USB_REQ_RECIPIENT_ENDPOINT)
            {
              /* Let the class implementation handle all recipients
               * (except for the endpoint recipient)
               */

              ra6m5_dispatchrequest(priv);
            }
          else
            {
              /* Endpoint recipient */

              epno = USB_EPNO(index.b[LSB]);
              if (USB_ENDPOINT_HALT == value.w)
                {
                  /* EP0 */

                  if (0 == epno)
                    {
                      /* Stall clear */

                      usb_cstd_clr_stall((uint16_t)USB_PIPE0);

                      /* Set pipe PID_BUF */

                      usb_cstd_set_buf((uint16_t)USB_PIPE0);
                    }

                  /* EP1 to max */

                  else if (epno <= USB_MAX_EP_NO)
                    {
                      pipe = usb_pstd_epadr2pipe(index.w);
                      if (USB_ERROR == pipe)
                        {
                          /* Request error */

                          usb_pstd_set_stall_pipe0();
                        }
                      else
                        {
                          if (USB_PID_BUF == usb_cstd_get_pid(pipe))
                            {
                              usb_cstd_set_nak(pipe);

                              /* SQCLR=1 */

                              hw_usb_set_sqclr(pipe);

                              /* Set pipe PID_BUF */

                              usb_cstd_set_buf(pipe);
                            }
                          else
                            {
                              usb_cstd_clr_stall(pipe);

                              /* SQCLR=1 */

                              hw_usb_set_sqclr(pipe);
                            }

                          /* Set pipe PID_BUF */

                          usb_cstd_set_buf((uint16_t)USB_PIPE0);
                        }
                    }
                  else
                    {
                      /* Request error */

                      usb_pstd_set_stall_pipe0();
                    }
                }
            }
        }
        break;

      case USB_REQ_SETFEATURE:
        {
          /* type:  host-to-device; recipient = device, interface, endpoint
           * value: feature selector
           * index: zero interface endpoint;
           * len:   0; data = none
           */

          usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_SETFEATURE),
                   priv->ctrl.type);
          if (((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) ==
              USB_REQ_RECIPIENT_DEVICE) && value.w == USB_FEATURE_TESTMODE)
            {
              /* Special case recipient=device test mode */

              uinfo ("test mode: %d\n", index.w);
            }
          else if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) !=
                   USB_REQ_RECIPIENT_ENDPOINT)
            {
              /* The class driver handles all recipients
               * except recipient=endpoint
               */

