gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
              ra6m5_dispatchrequest(priv);
            }
          else
            {
              /* Handler recipient=endpoint */

              epno = USB_EPNO(index.b[LSB]);
              if (USB_ENDPOINT_HALT == value.w)
                {
                  /* EP0 */

                  if (0 == epno)
                    {
                      /* Set pipe PID_BUF */

                      usb_cstd_set_buf((uint16_t)USB_PIPE0);
                    }

                  /* EP1 to max */

                  else if (epno <= USB_MAX_EP_NO)
                    {
                      pipe = usb_pstd_epadr2pipe(index.w);
                      if (USB_ERROR == pipe)
                        {
                          /* Request error */

                          usb_pstd_set_stall_pipe0();
                        }
                      else
                        {
                          /* Set pipe USB_PID_STALL */

                          usb_pstd_set_stall(pipe);

                          /* Set pipe PID_BUF */

                          usb_cstd_set_buf((uint16_t)USB_PIPE0);
                        }
                    }
                  else
                    {
                      /* Request error */

                      usb_pstd_set_stall_pipe0();
                    }
                }
              else
                {
                  /* Not specification */

                  usb_pstd_set_stall_pipe0();
                }
            }
        }
        break;

      case USB_REQ_SETADDRESS:
        {
          /* type:  host-to-device; recipient = device
           * value: device address
           * index: 0
           * len:   0; data = none
           */

          if ((0 == index.w) && (0 == len.w))
            {
              if (value.w <= 127)
                {
                  /* Set pipe PID_BUF */

                  usb_cstd_set_buf((uint16_t)USB_PIPE0);
                }
              else
                {
                  /* Not specification */

                  usb_pstd_set_stall_pipe0();
                }
            }
          else
            {
              /* Not specification */

              usb_pstd_set_stall_pipe0();
            }
        }
        break;

      case USB_REQ_GETDESCRIPTOR:
      case USB_REQ_SETDESCRIPTOR:
        /* type:  host-to-device; recipient = device
         * value: descriptor type and index
         * index: 0 or language ID;
         * len:   descriptor len; data = descriptor
         */

        {
          uinfo("Get Descriptor Request Got from Host");
          usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_GETCONFIG),
                   priv->ctrl.type);
          /* The request seems valid... let the class
           * implementation handle it
           */

          ra6m5_dispatchrequest(priv);
        }
        break;

      case USB_REQ_GETCONFIGURATION:

        /* type:  device-to-host; recipient = device
         * value: 0;
         * index: 0;
         * len:   1; data = configuration value
         */

      case USB_REQ_SETCONFIGURATION:

        /* type:  host-to-device; recipient = device
         * value: configuration value
         * index: 0;
         * len:   0; data = none
         */

        {
          usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_SETCONFIG), 0);
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) ==
              USB_REQ_RECIPIENT_DEVICE)
            {
              ra6m5_dispatchrequest(priv);
            }
          else
            {
              usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_BADSETCONFIG), 0);
              priv->stalled = 1;
            }
        }
        break;

      case USB_REQ_GETINTERFACE:

        /* type:  device-to-host; recipient = interface
         * value: 0
         * index: interface;
         * len:   1; data = alt interface
         */

      case USB_REQ_SETINTERFACE:

        /* type:  host-to-device; recipient = interface
         * value: alternate setting
         * index: interface;
         * len:   0; data = none
         */

        {
          /* Let the class implementation handle the request */

          usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_GETSETIF),
                   priv->ctrl.type);
          ra6m5_dispatchrequest(priv);
        }
        break;

      case USB_REQ_SYNCHFRAME:

        /* type:  device-to-host; recipient = endpoint
         * value: 0
         * index: endpoint;
         * len:   2; data = frame number
         */

        {
          usbtrace(TRACE_INTDECODE(RA6M5_TRACEINTID_SYNCHFRAME), 0);
        }
        break;

      default:
        {
          usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDCTRLREQ),
                   priv->ctrl.req);
          priv->ep0state = EP0STATE_STALLED;
        }
        break;
    }
}

/****************************************************************************
 * Name: usb_pstd_pipe2fport
 *
 * Description:
 *   Get Pipe Number to FIFO port address
 *
 ****************************************************************************/

uint16_t usb_pstd_pipe2fport(uint16_t pipe)
{
  uint16_t fifo_mode = USB_CUSE;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_NULL; /* Error */
    }

  return fifo_mode;
}

/****************************************************************************
 * Name: hw_usb_write_pipeperi
 *
 * Description:
 *   Write to PIPE PERI register
 *
 ****************************************************************************/

static void hw_usb_write_pipeperi(uint16_t data)
{
  ra6m5_usbdev_putreg16(data, RA6M5_USB_PIPEPERI_OFFSET);
}

/****************************************************************************
 * Name: usb_cstd_pipe_init
 *
 * Description:
 *  Pipe initialization
 *
 ****************************************************************************/

static void usb_cstd_pipe_init(uint16_t pipe, uint16_t pipe_cfg,
                               uint16_t maxpacket)
{
  uint16_t pipe_peri = 0;

  /* Interrupt Disable */

  /* Ready         Int Disable */

  hw_usb_clear_brdyenb(pipe);

  /* NotReady      Int Disable */

