gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  hw_usb_clear_nrdyenb(pipe);

  /* Empty/SizeErr Int Disable */

  hw_usb_clear_bempenb(pipe);

  /* PID=NAK & clear STALL */

  usb_cstd_clr_stall(pipe);

  /* PIPE Configuration */

  hw_usb_write_pipesel(pipe);

  hw_usb_write_pipecfg(pipe_cfg);

  hw_usb_write_pipemaxp(maxpacket);
  hw_usb_write_pipeperi(pipe_peri);

  /* FIFO buffer DATA-PID initialized */

  hw_usb_write_pipesel(USB_PIPE0);

  /* SQCLR */

  hw_usb_set_sqclr(pipe);

  /* ACLRM */

  usb_cstd_do_aclrm(pipe);

  /* Interrupt status clear */

  /* Ready         Int Clear */

  hw_usb_clear_sts_brdy(pipe);

  /* NotReady      Int Clear */

  hw_usb_clear_status_nrdy(pipe);

  /* Empty/SizeErr Int Clear */

  hw_usb_clear_status_bemp(pipe);
}

/****************************************************************************
 * Name: usb_pstd_set_pipe_reg
 *
 * Description:
 *  Set Pipe Register
 *
 ****************************************************************************/

void usb_pstd_set_pipe_reg(uint16_t pipe_no, uint16_t pipe_cfgint,
                           uint16_t pipe_cfgbulkin,
                           uint16_t pipe_cfgbulkout, uint16_t maxpacket)
{
  /* Search use pipe block */

  /* WAIT_LOOP */

  /* Initialization of registers associated with specified pipe. */

  if (pipe_no == BULK_IN_PIPE)
    {
      usb_cstd_pipe_init(pipe_no, pipe_cfgbulkin, maxpacket);
    }

  else if (pipe_no == INT_IN_PIPE)
    {
      usb_cstd_pipe_init(pipe_no, pipe_cfgint, maxpacket);
    }

  else if (pipe_no == BULK_OUT_PIPE)
    {
      usb_cstd_pipe_init(pipe_no, pipe_cfgbulkout, maxpacket);
    }
}

/****************************************************************************
 * Endpoint Methods
 ****************************************************************************/

/****************************************************************************
 * Name: ra6m5_epconfigure
 *
 * Description:
 *   Configure endpoint, making it usable
 *
 * Input Parameters:
 *   ep   - the struct usbdev_ep_s instance obtained from allocep()
 *   desc - A struct usb_epdesc_s instance describing the endpoint
 *   last - true if this is the last endpoint to be configured.  Some
 *          hardware needs to take special action when all of the endpoints
 *          have been configured.
 *
 ****************************************************************************/

static int ra6m5_epconfigure(struct usbdev_ep_s *ep,
                             const struct usb_epdesc_s *desc, bool last)
{
  uint16_t maxpacket;
  uint8_t  epno;
  uint16_t pipe_no = 0;
  uint16_t pipe_cfg_int = 0;
  uint16_t pipe_cfg_bulkin = 0;
  uint16_t pipe_cfg_bulkout = 0;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !desc)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      printf("ERROR: ep=%p desc=%p\n", ep, desc);
      return -EINVAL;
    }
#endif

  /* Get the unadorned endpoint address */

  epno = USB_EPNO(desc->addr);

  usbtrace(TRACE_EPCONFIGURE, (uint16_t)epno);
  DEBUGASSERT(epno == USB_EPNO(ep->eplog));

  /* Set the requested type */

  switch (desc->attr & USB_EP_ATTR_XFERTYPE_MASK)
    {
      case USB_EP_ATTR_XFER_INT: /* Interrupt endpoint */
        if (USB_ISEPIN(desc->addr) && epno == INT_IN_EPNUM)
          {
            /* The full, logical EP number includes direction */

            ep->eplog = USB_EPIN(epno);
            pipe_no = INT_IN_PIPE;
            pipe_cfg_int = (uint16_t)(USB_TYPFIELD_INT | USB_DIR_P_IN |
                                      epno);
          }

        if (USB_ISEPOUT(desc->addr))
         {
           /* The full, logical EP number includes direction */

           ep->eplog = USB_EPOUT(epno);
           pipe_no = INT_OUT_PIPE;
           pipe_cfg_int = (uint16_t)(USB_TYPFIELD_INT | USB_DIR_P_OUT |
                                     epno);
         }
        break;

      case USB_EP_ATTR_XFER_BULK: /* Bulk endpoint */
        if (USB_ISEPIN(desc->addr) && epno == BULK_IN_EPNUM)
          {
            /* The full, logical EP number includes direction */

            ep->eplog = USB_EPIN(epno);
            pipe_no = BULK_IN_PIPE;
            pipe_cfg_bulkin = (uint16_t)(USB_TYPFIELD_BULK | USB_CFG_DBLB |
                                         USB_DIR_P_IN | epno);
          }

        if (USB_ISEPOUT(desc->addr))
          {
            /* The full, logical EP number includes direction */

            ep->eplog = USB_EPOUT(epno);
            pipe_no = BULK_OUT_PIPE;
            pipe_cfg_bulkout = (uint16_t)(USB_TYPFIELD_BULK | USB_CFG_DBLB |
                                          USB_SHTNAKFIELD | USB_DIR_P_OUT |
                                          epno);
          }

        break;

      case USB_EP_ATTR_XFER_ISOC: /* Isochronous endpoint */

        /* Not Supported */

        break;

      case USB_EP_ATTR_XFER_CONTROL: /* Control endpoint */
        hw_usb_write_dcpcfg(0);
        hw_usb_write_dcpmxps(USB_DCPMAXP);
        break;

      default:
        usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_BADEPTYPE),
                 (uint16_t)desc->type);
        return -EINVAL;
  }

  maxpacket = GETUINT16(desc->mxpacketsize);
  hw_usb_write_pipemaxp(maxpacket);
  ep->maxpacket = maxpacket;

  hw_usb_write_dcpmxps(USB_DCPMAXP);

  usb_pstd_set_pipe_reg(pipe_no, pipe_cfg_int, pipe_cfg_bulkin,
                        pipe_cfg_bulkout, maxpacket);

  return OK;
}

/****************************************************************************
 * Name: ra6m5_epdisable
 *
 * Description:
 *   The endpoint will no longer be used
 *
 ****************************************************************************/

static int ra6m5_epdisable(struct usbdev_ep_s *ep)
{
  struct ra6m5_ep_s *privep = (struct ra6m5_ep_s *)ep;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      uerr("ERROR: ep=%p\n", ep);
      return -EINVAL;
    }
#endif

  /* Cancel any ongoing activity */

  flags = enter_critical_section();
  ra6m5_cancelrequests(privep);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: ra6m5_epallocreq
 *
 * Description:
 *   Allocate an I/O request
 *
 ****************************************************************************/

