gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
static struct usbdev_req_s *ra6m5_epallocreq(struct usbdev_ep_s *ep)
{
  struct ra6m5_req_s *privreq;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }

#endif
  usbtrace(TRACE_EPALLOCREQ, USB_EPNO(ep->eplog));

  privreq = (struct ra6m5_req_s *)kmm_malloc(sizeof(struct ra6m5_req_s));
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_ALLOCFAIL), 0);
      return NULL;
    }

  memset(privreq, 0, sizeof(struct ra6m5_req_s));
  return &privreq->req;
}

/****************************************************************************
 * Name: ra6m5_epfreereq
 *
 * Description:
 *   Free an I/O request
 *
 ****************************************************************************/

static void ra6m5_epfreereq(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct ra6m5_req_s *privreq = (struct ra6m5_req_s *)req;
#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      return;
    }

#endif
  usbtrace(TRACE_EPFREEREQ, USB_EPNO(ep->eplog));
  kmm_free(privreq);
}

/****************************************************************************
 * Name: ra6m5_epsubmit
 *
 * Description:
 *   Submit an I/O request to the endpoint
 *
 ****************************************************************************/

static int ra6m5_epsubmit(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct ra6m5_req_s *privreq = (struct ra6m5_req_s *)req;
  struct ra6m5_ep_s *privep = (struct ra6m5_ep_s *)ep;
  struct ra6m5_usbdev_s *priv;
  irqstate_t flags;
  uint8_t epno;
  int ret = OK;

#ifdef CONFIG_DEBUG_FEATURES
  if (!req || !req->callback || !req->buf || !ep)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      printf("ERROR: req=%p callback=%p buf=%p ep=%p\n",
           req, req->callback, req->buf, ep);
      return -EINVAL;
    }
#endif

  usbtrace(TRACE_EPSUBMIT, USB_EPNO(ep->eplog));
  priv = privep->dev;

#ifdef CONFIG_DEBUG_FEATURES
  if (!priv->driver)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_NOTCONFIGURED),
               priv->usbdev.speed);
      printf("ERROR: driver=%p\n", priv->driver);
      return -ESHUTDOWN;
    }
#endif

  /* Handle the request from the class driver */

  epno        = USB_EPNO(ep->eplog);
  req->result = -EINPROGRESS;
  req->xfrd   = 0;
  flags       = enter_critical_section();

  /* If we are stalled, then drop all requests on the floor */

  if (privep->stalled)
    {
      ra6m5_abortrequest(privep, privreq, -EBUSY);
      printf("ERROR: stalled\n");
      ret = -EBUSY;
    }

  /* Handle IN (device-to-host) requests.  NOTE:  If the class device is
   * using the bi-directional EP0, then we assume that they intend the EP0
   * IN functionality.
   */

  else if (epno == EP0)
    {
      /* Add the new request to the request queue for the IN endpoint */

      usbtrace(TRACE_INREQQUEUED(epno), req->len);
      ra6m5_rqenqueue(privep, privreq);

      if (priv->ep0state == EP0STATE_RDREQUEST)
        {
          privreq->req.len = CDC_CLASS_DATA_LENGTH;
          ra6m5_rdrequest(epno, priv, privep);
          leave_critical_section(flags);
          return OK;
        }

      /* If the IN endpoint FIFO is available, then transfer the data now */

      if (!privep->txbusy)
        {
          ret = ra6m5_wrrequest(epno, priv, privep);
          leave_critical_section(flags);
          return OK;
        }
    }

  else if (USB_ISEPIN(ep->eplog) || epno == EP0)
    {
      /* Add the new request to the request queue for the IN endpoint */

      usbtrace(TRACE_INREQQUEUED(epno), req->len);
      ra6m5_rqenqueue(privep, privreq);
      if (priv->ep0state == EP0STATE_RDREQUEST)
        {
          ra6m5_rdrequest(epno, priv, privep);
          leave_critical_section(flags);
          return OK;
        }

      /* If the IN endpoint FIFO is available, then transfer the data now */

      if (!privep->txbusy)
        {
          ret = ra6m5_wrrequest(epno, priv, privep);
        }
    }

  /* Handle OUT (host-to-device) requests */

  else
    {
      /* Add the new request to the request queue for the OUT endpoint */

      privep->txnullpkt = 0;
      ra6m5_rqenqueue(privep, privreq);
      usbtrace(TRACE_OUTREQQUEUED(epno), req->len);

      /* This there a incoming data pending the availability of a request? */

      /* This there a incoming data pending the availability of a request? */

      if (priv->rxpending > 0)
        {
          ret = ra6m5_rdrequest(epno, priv, privep);
          priv->rxpending--;
        }
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: ra6m5_cancelrequests
 ****************************************************************************/

static void ra6m5_cancelrequests(struct ra6m5_ep_s *privep)
{
  while (!ra6m5_rqempty(privep))
    {
      usbtrace(TRACE_COMPLETE(USB_EPNO(privep->ep.eplog)),
               (ra6m5_rqpeek(privep))->req.xfrd);
      ra6m5_reqcomplete(privep, -ESHUTDOWN);
    }
}

/****************************************************************************
 * Name: ra6m5_epcancel
 *
 * Description:
 *   Cancel an I/O request previously sent to an endpoint
 *
 ****************************************************************************/

static int ra6m5_epcancel(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct ra6m5_ep_s *privep = (struct ra6m5_ep_s *)ep;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_USB
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }

#endif
  usbtrace(TRACE_EPCANCEL, USB_EPNO(ep->eplog));

  flags = enter_critical_section();
  ra6m5_cancelrequests(privep);
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: ra6m5_epreserve
 ****************************************************************************/

static inline struct ra6m5_ep_s *ra6m5_epreserve(struct ra6m5_usbdev_s *priv,
                                                 uint8_t epset)
{
  struct ra6m5_ep_s *privep = NULL;
  irqstate_t flags;
  int epndx = 0;

  flags = enter_critical_section();
  epset &= priv->epavail;
  if (epset)
    {
      /* Select the lowest bit in the set of matching, available endpoints
       * (skipping EP0)
       */

      for (epndx = 1; epndx < RA6M5_NENDPOINTS; epndx++)
        {
          uint8_t bit = RA6M5_ENDP_BIT(epndx);
          if ((epset & bit) != 0)
            {
              /* Mark the endpoint no longer available */

              priv->epavail &= ~bit;

              /* And return the pointer to the standard endpoint structure */

