gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
              privep = &priv->eplist[epndx];
              break;
            }
        }
    }

  leave_critical_section(flags);
  return privep;
}

/****************************************************************************
 * Device Methods
 ****************************************************************************/

/****************************************************************************
 * Name: ra6m5_allocep
 *
 * Description:
 *   Allocate an endpoint matching the parameters
 *
 * Input Parameters:
 *   eplog  - 7-bit logical endpoint number (direction bit ignored).
 *   Zero means that any endpoint matching the other requirements
 *   will suffice.  The assigned endpoint can be found in
 *   the eplog field. in     - true: IN (device-to-host)
 *   endpoint requested eptype - Endpoint type.  One of
 *   {USB_EP_ATTR_XFER_ISOC, USB_EP_ATTR_XFER_BULK,
 *    USB_EP_ATTR_XFER_INT}
 *
 ****************************************************************************/

static struct usbdev_ep_s *ra6m5_allocep(struct usbdev_s *dev, uint8_t epno,
                                         bool in, uint8_t eptype)
{
  struct ra6m5_usbdev_s *priv = (struct ra6m5_usbdev_s *)dev;
  struct ra6m5_ep_s *privep = NULL;
  uint8_t epset = RA6M5_ENDP_ALLSET;

  usbtrace(TRACE_DEVALLOCEP, (uint16_t)epno);
#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }
#endif

  /* Ignore any direction bits in the logical address */

  epno = USB_EPNO(epno);

  /* A logical address of 0 means that any endpoint will do */

  if (epno > 0)
    {
      /* Otherwise, we will return the endpoint structure only
       * for the requested 'logical' endpoint. All of the other
       * checks will still be performed.
       *
       * First, verify that the logical endpoint is in
       * the range supported by
       * by the hardware.
       */

      if (epno >= RA6M5_NENDPOINTS)
        {
          usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_BADEPNO), (uint16_t)epno);
          return NULL;
        }

      /* Convert the logical address to a physical OUT endpoint address and
       * remove all of the candidate endpoints from the bitset except for the
       * the IN/OUT pair for this logical address.
       */

      epset = RA6M5_ENDP_BIT(epno);
    }

  /* Check if the selected endpoint number is available */

  privep = ra6m5_epreserve(priv, epset);
  if (!privep)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_EPRESERVE), (uint16_t)epset);
      goto errout;
    }

  return &privep->ep;

errout:
  return NULL;
}

/****************************************************************************
 * Name: ra6m5_epunreserve
 ****************************************************************************/

static inline void
ra6m5_epunreserve(struct ra6m5_usbdev_s *priv, struct ra6m5_ep_s *privep)
{
  irqstate_t flags = enter_critical_section();
  priv->epavail |= RA6M5_ENDP_BIT(USB_EPNO(privep->ep.eplog));
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: ra6m5_freeep
 *
 * Description:
 *   Free the previously allocated endpoint
 *
 ****************************************************************************/

static void ra6m5_freeep(struct usbdev_s *dev, struct
                         usbdev_ep_s *ep)
{
  struct ra6m5_usbdev_s *priv;
  struct ra6m5_ep_s *privep;

#ifdef CONFIG_DEBUG_USB
  if (!dev || !ep)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      return;
    }
#endif

  priv   = (struct ra6m5_usbdev_s *)dev;
  privep = (struct ra6m5_ep_s *)ep;
  usbtrace(TRACE_DEVFREEEP, (uint16_t)USB_EPNO(ep->eplog));

  if (priv && privep)
    {
      /* Mark the endpoint as available */

      ra6m5_epunreserve(priv, privep);
    }
}

/****************************************************************************
 * Name: ra6m5_getframe
 *
 * Description:
 *   Returns the current frame number
 *
 ****************************************************************************/

static int ra6m5_getframe(struct usbdev_s *dev)
{
  int regval;
  regval = (ra6m5_usbdev_getreg16(RA6M5_USB_FRMNUM_OFFSET) & USB_FRMNUM_VAL);
  return regval;
}

/****************************************************************************
 * Name: ra6m5_wakeup
 *
 * Description:
 *   Tries to wake up the host connected to this device
 *
 ****************************************************************************/

static int ra6m5_wakeup(struct usbdev_s *dev)
{
  uint16_t regval;
  regval = ra6m5_usbdev_getreg16 (RA6M5_USB_INTENB0_OFFSET);
  regval |= USB_RSME;
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_INTENB0_OFFSET);
  return OK;
}

/****************************************************************************
 * Name: ra6m5_selfpowered
 *
 * Description:
 *   Sets/clears the device selfpowered feature
 *
 ****************************************************************************/

static int ra6m5_selfpowered(struct usbdev_s *dev, bool selfpowered)
{
#ifdef CONFIG_USBDEV_SELFPOWERED
  struct ra6m5_usbdev_s *priv = (struct ra6m5_usbdev_s *)dev;

  usbtrace(TRACE_DEVSELFPOWERED, (uint16_t)selfpowered);

#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      return -ENODEV;
    }
#endif

  priv->selfpowered = selfpowered;

  return OK;
#else
  /* Do Nothing for bus powered configuration */

  return OK;

#endif
}

/****************************************************************************
 * Name: ra6m5_pullup
 *
 * Description:
 *    Software-controlled connect to/disconnect from USB host
 *
 ****************************************************************************/

int ra6m5_pullup(struct usbdev_s *dev, bool enable)
{
  uint16_t regval;

  /* Disable DRPD bit in SYSCFG register */

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_SYSCFG_OFFSET);
  regval &= ~(USB_DRPD);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_SYSCFG_OFFSET);

  return OK;
}

/****************************************************************************
 * Name: usb_pstd_attach_process
 *
 * Description:
 *   Set the DPRPU bit
 *
 ****************************************************************************/

void usb_pstd_attach_process(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_SYSCFG_OFFSET);
  regval |= (USB_DPRPU);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_SYSCFG_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_pclear_dprpu
 *
 * Description:
 *   Clear the DPRPU bit
 *
 ****************************************************************************/

void hw_usb_pclear_dprpu(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_SYSCFG_OFFSET);
  regval &= ~(USB_DPRPU);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_SYSCFG_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_clear_aclrm
 *
 * Description:
 *   Clear ACLRM bit
 *
 ****************************************************************************/

static void hw_usb_clear_aclrm(uint16_t pipeno)
{
  uint16_t *p_reg;

