gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1CTR_OFFSET + ((pipeno - 1) * 2));

  (*p_reg) &= (~USB_ACLRM);
}

/****************************************************************************
 * Name: hw_usb_set_aclrm
 *
 * Description:
 *   Set ACLRM bit
 *
 ****************************************************************************/

static void hw_usb_set_aclrm(uint16_t pipeno)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1CTR_OFFSET + ((pipeno - 1) * 2));

  (*p_reg) |= USB_ACLRM;
}

/****************************************************************************
 * Name: usb_cstd_do_aclrm
 *
 * Description:
 *   Control ACLRM bit
 *
 ****************************************************************************/

static void usb_cstd_do_aclrm(uint16_t pipe)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Control ACLRM */

  hw_usb_set_aclrm(pipe);

  hw_usb_clear_aclrm(pipe);
}

/****************************************************************************
 * Name: hw_usb_set_curpipe
 *
 * Description:
 *   Set Current Pipe
 *
 ****************************************************************************/

static void hw_usb_set_curpipe(uint16_t pipemode, uint16_t pipeno)
{
  uint16_t *p_reg;
  uint16_t reg;

  p_reg = hw_usb_get_fifosel_adr(pipemode);
  reg = *p_reg;

  if ((USB_D0USE == pipemode) || (USB_D1USE == pipemode))
    {
      reg &= (~USB_DREQE);
    }

  reg &= (~USB_CURPIPE);
  *p_reg = reg;

  /* WAIT_LOOP */

  while (0 != ((*p_reg) & USB_CURPIPE))
    {
      /* Wait Clear CURPIPE */
    }

  reg |= pipeno;

  *p_reg = reg;
}

/****************************************************************************
 * Name: hw_usb_rmw_fifosel
 *
 * Description:
 *   Clear FIFOSEL bit
 *
 ****************************************************************************/

static void hw_usb_rmw_fifosel(uint16_t pipemode, uint16_t data,
                               uint16_t bitptn)
{
  uint16_t buf;
  uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifosel_adr(pipemode);

  buf = *p_reg;
  buf &= (~bitptn);
  buf |= (data & bitptn);
  *p_reg = buf;
}

/****************************************************************************
 * Name: usb_cstd_chg_curpipe
 *
 * Description:
 *   Current Pipe Check
 *
 ****************************************************************************/

static void usb_cstd_chg_curpipe(uint16_t pipe, uint16_t fifosel,
                                 uint16_t isel)
{
  uint16_t buf;

  /* Select FIFO */

  switch (fifosel)
    {
      /* CFIFO use */

      case USB_CUSE:

        /* ISEL=1, CURPIPE=0 */

        hw_usb_rmw_fifosel(USB_CUSE, ((USB_RCNT | isel) | pipe),
                           ((USB_RCNT | USB_ISEL) | USB_CURPIPE));
        break;

        /* D0FIFO use */

      case USB_D0USE:

        /* D1FIFO use */

      case USB_D1USE:

        /* DxFIFO pipe select */

        hw_usb_set_curpipe(fifosel, pipe);

        /* WAIT_LOOP */

        do
          {
            buf = hw_usb_read_fifosel(fifosel);
          }
        while ((uint16_t)(buf & USB_CURPIPE) != pipe);
        break;

      default:
        break;
    }
}

/****************************************************************************
 * Name: hw_usb_get_fifosel_adr
 *
 * Description:
 *   Get FIFOSEL register address
 *
 ****************************************************************************/

static void *hw_usb_get_fifosel_adr(uint16_t pipemode)
{
  void *p_reg = NULL;

  switch (pipemode)
    {
      case USB_CUSE:
        p_reg = (void *)(RA6M5_USBFS_BASE + RA6M5_USB_CFIFOSEL_OFFSET);
        break;

      case USB_D0USE:
        p_reg = (void *)(RA6M5_USBFS_BASE + RA6M5_USB_D0FIFOSEL_OFFSET);
        break;

      case USB_D1USE:
        p_reg = (void *)(RA6M5_USBFS_BASE + RA6M5_USB_D1FIFOSEL_OFFSET);
        break;

      default:
        break;
    }

  return p_reg;
}

/****************************************************************************
 * Name: hw_usb_read_fifosel
 *
 * Description:
 *   Read FIFOSEL Register
 *
 ****************************************************************************/

static uint16_t hw_usb_read_fifosel(uint16_t pipemode)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifosel_adr(pipemode);

  return *p_reg;
}

/****************************************************************************
 * Name: hw_usb_set_trclr
 *
 * Description:
 *   Set Transaction Clear bit
 *
 ****************************************************************************/

static void hw_usb_set_trclr(uint16_t pipeno)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1TRE_OFFSET + ((pipeno - 1) * 4));

  (*p_reg) |= USB_TRCLR;
}

/****************************************************************************
 * Name: hw_usb_clear_trenb
 *
 * Description:
 *   Clear Transaction Enable
 *
 ****************************************************************************/

static void hw_usb_clear_trenb(uint16_t pipeno)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1TRE_OFFSET + ((pipeno - 1) * 2));
  (*p_reg) &= (~USB_TRENB);
}

/****************************************************************************
 * Name: usb_cstd_clr_transaction_counter
 *
 * Description:
 *   Clear Transaction Counter
 *
 ****************************************************************************/

static void usb_cstd_clr_transaction_counter(uint16_t trnreg)
{
  hw_usb_clear_trenb(trnreg);
  hw_usb_set_trclr(trnreg);
}

/****************************************************************************
 * Name: hw_usb_clear_bempenb
 *
 * Description:
 *   Clear BEMPENB
 *
 ****************************************************************************/

static void hw_usb_clear_bempenb(uint16_t pipeno)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_BEMPENB_OFFSET);
  regval &= (~(1 << pipeno));
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_BEMPENB_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_clear_nrdyenb
 *
 * Description:
 *   Clear NRDYENB
 *
 ****************************************************************************/

static void hw_usb_clear_nrdyenb(uint16_t pipeno)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_NRDYENB_OFFSET);
  regval &= (~(1 << pipeno));
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_NRDYENB_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_clear_brdyenb
 *
 * Description:
 *   Clear BRDYENB
 *
 ****************************************************************************/

