gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
static void hw_usb_clear_brdyenb(uint16_t pipeno)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_BRDYENB_OFFSET);
  regval &= (~(1 << pipeno));
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_BRDYENB_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_read_pipectr
 *
 * Description:
 *   Read PIPECTR
 *
 ****************************************************************************/

static uint16_t hw_usb_read_pipectr(uint16_t pipeno)
{
  uint16_t *p_reg;

  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_DCPCTR_OFFSET);
    }
  else
    {
      p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1CTR_OFFSET + ((pipeno - 1) * 2));
    }

  return *p_reg;
}

/****************************************************************************
 * Name: hw_usb_clear_pid
 *
 * Description:
 *   Clear pid
 *
 ****************************************************************************/

static void hw_usb_clear_pid(uint16_t pipeno, uint16_t data)
{
  uint16_t *p_reg;

  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_DCPCTR_OFFSET);
    }
  else
    {
       p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1CTR_OFFSET + ((pipeno - 1) * 2));
    }

  (*p_reg) &= (~data);
}

/****************************************************************************
 * Name: usb_cstd_set_nak
 *
 * Description:
 *   Set NAK
 *
 ****************************************************************************/

static void usb_cstd_set_nak(uint16_t pipe)
{
  uint16_t buf;
  uint16_t n;

  /* Set NAK */

  hw_usb_clear_pid(pipe, (uint16_t)USB_PID_BUF);

  /* The state of PBUSY continues while transmitting
   * the packet when it is a detach.
   */

  /* 1ms comes off when leaving because the packet
   * duration might not exceed 1ms.
   */

  /* Whether it is PBUSY release or
   * 1ms passage can be judged.
   */

  /* WAIT_LOOP */

  for (n = 0; n < 0xffff; ++n)
    {
      /* PIPE control reg read */

      buf = hw_usb_read_pipectr(pipe);
      if (0 == (uint16_t)(buf & USB_PBUSY))
        {
          n = 0xfffe;
        }
    }
}

/****************************************************************************
 * Name: usb_pstd_forced_termination
 *
 * Description:
 *   Clear the buffer data
 *
 ****************************************************************************/

void usb_pstd_forced_termination(uint16_t pipe, uint16_t status)
{
  uint16_t buf;

  /* PID = NAK */

  /* Set NAK */

  usb_cstd_set_nak(pipe);

  /* Disable Interrupt */

  /* Disable Ready Interrupt */

  hw_usb_clear_brdyenb(pipe);

  /* Disable Not Ready Interrupt */

  hw_usb_clear_nrdyenb(pipe);

  /* Disable Empty Interrupt */

  hw_usb_clear_bempenb(pipe);

  usb_cstd_clr_transaction_counter(pipe);

  /* Clear CFIFO-port */

  buf = hw_usb_read_fifosel(USB_CUSE);

  if ((buf & USB_CURPIPE) == pipe)
    {
      /* Changes the FIFO port by the pipe. */

      usb_cstd_chg_curpipe((uint16_t)USB_PIPE0, (uint16_t)USB_CUSE,
                           USB_FALSE);
    }

  /* Do Aclr */

  usb_cstd_do_aclrm(pipe);
}

/****************************************************************************
 * Name: usb_cstd_clr_stall
 *
 * Description:
 *   Clear Stall
 *
 ****************************************************************************/

static void usb_cstd_clr_stall(uint16_t pipe)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Set NAK */

  usb_cstd_set_nak(pipe);

  /* Clear STALL */

  hw_usb_clear_pid(pipe, USB_PID_STALL);
}

/****************************************************************************
 * Name: hw_usb_write_pipesel
 *
 * Description:
 *   Write to PIPESEL register
 *
 ****************************************************************************/

static void hw_usb_write_pipesel(uint16_t data)
{
  ra6m5_usbdev_putreg16(data, RA6M5_USB_PIPESEL_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_write_pipecfg
 *
 * Description:
 *   Write to PIPECFG register
 *
 ****************************************************************************/

static void hw_usb_write_pipecfg(uint16_t data)
{
  ra6m5_usbdev_putreg16(data, RA6M5_USB_PIPECFG_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_write_pipemaxp
 *
 * Description:
 *   Write to PIPEMAXP register
 *
 ****************************************************************************/

static void hw_usb_write_pipemaxp(uint16_t data)
{
  ra6m5_usbdev_putreg16(data, RA6M5_USB_PIPEMAXP_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_write_pipeperi
 *
 * Description:
 *   Write to PIPEPERI register
 *
 ****************************************************************************/

/****************************************************************************
 * Name: hw_usb_set_sqclr
 *
 * Description:
 *   Write to SQCLR register
 *
 ****************************************************************************/

static void hw_usb_set_sqclr(uint16_t pipeno)
{
  uint16_t *p_reg;
  uint16_t regval;

  if (USB_PIPE0 == pipeno)
    {
      regval = ra6m5_usbdev_getreg16(RA6M5_USB_DCPCTR_OFFSET);
      regval |= USB_SQCLR;
      ra6m5_usbdev_putreg16(regval, RA6M5_USB_DCPCTR_OFFSET);
    }
  else
    {
      p_reg = (uint16_t *)(RA6M5_USBFS_BASE + RA6M5_USB_PIPE1CTR_OFFSET + ((pipeno - 1) * 2));
      (*p_reg) |= USB_SQCLR;
    }
}

/****************************************************************************
 * Name: hw_usb_clear_sts_brdy
 *
 * Description:
 *   Clear BRDY status
 *
 ****************************************************************************/

static void hw_usb_clear_sts_brdy(uint16_t pipeno)
{
  ra6m5_usbdev_putreg16((~(1 << pipeno)) & USB_PIPE_ALL,
                 RA6M5_USB_BRDYSTS_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_clear_status_nrdy
 *
 * Description:
 *   Clear NRDY status
 *
 ****************************************************************************/

