gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
static void hw_usb_clear_status_nrdy(uint16_t pipeno)
{
  ra6m5_usbdev_putreg16((~(1 << pipeno)) & USB_PIPE_ALL,
                 RA6M5_USB_NRDYSTS_OFFSET);
}

/****************************************************************************
 * Name: usb_cstd_clr_pipe_cnfg
 *
 * Description:
 *   Clear pipe configuration
 *
 ****************************************************************************/

static void usb_cstd_clr_pipe_cnfg(uint16_t pipe_no)
{
  /* PID=NAK & clear STALL */

  usb_cstd_clr_stall(pipe_no);

  /* Interrupt disable */

  /* Ready         Int Disable */

  hw_usb_clear_brdyenb(pipe_no);

  /* NotReady      Int Disable */

  hw_usb_clear_nrdyenb(pipe_no);

  /* Empty/SizeErr Int Disable */

  hw_usb_clear_bempenb(pipe_no);

  /* PIPE Configuration */

  usb_cstd_chg_curpipe((uint16_t)USB_PIPE0, (uint16_t)USB_CUSE, USB_FALSE);
  hw_usb_write_pipesel(pipe_no);
  hw_usb_write_pipecfg(0);

  hw_usb_write_pipemaxp(0);
  hw_usb_write_pipeperi(0);
  hw_usb_write_pipesel(0);

  /* FIFO buffer DATA-PID initialized */

  /* SQCLR */

  hw_usb_set_sqclr(pipe_no);

  /* ACLRM */

  usb_cstd_do_aclrm(pipe_no);
  usb_cstd_clr_transaction_counter(pipe_no);

  /* Interrupt status clear */

  /* Ready         Int Clear */

  hw_usb_clear_sts_brdy(pipe_no);

  /* NotReady      Int Clear */

  hw_usb_clear_status_nrdy(pipe_no);

  /* Empty/SizeErr Int Clear */

  hw_usb_clear_status_bemp(pipe_no);
}

/****************************************************************************
 * Name: hw_usb_clear_status_bemp
 *
 * Description:
 *   Clear BEMP status
 *
 ****************************************************************************/

static void hw_usb_clear_status_bemp(uint16_t pipeno)
{
  ra6m5_usbdev_putreg16((~(1 << pipeno)) & USB_PIPE_ALL,
                 RA6M5_USB_BEMPSTS_OFFSET);
}

/****************************************************************************
 * Name: usb_pstd_detach_process
 *
 * Description:
 *   Set the DPRPU bit
 *
 ****************************************************************************/

void usb_pstd_detach_process(void)
{
  int i;

  /* Pull-up disable */

  hw_usb_pclear_dprpu();
  for (i = USB_MIN_PIPE_NO; i < (USB_MAX_PIPE_NO +1); i++)
    {
      usb_pstd_forced_termination(i, (uint16_t)USB_DATA_STOP);
      usb_cstd_clr_pipe_cnfg(i);
    }

  usb_pstd_forced_termination(i, (uint16_t)USB_DATA_STOP);
  usb_cstd_clr_pipe_cnfg(i);
}

/****************************************************************************
 * Name: usb_pstd_chk_vbsts
 *
 * Description:
 *   USB VBUS Status check
 *
 ****************************************************************************/

uint16_t usb_pstd_chk_vbsts(void)
{
  uint16_t buf1;
  uint16_t buf2;
  uint16_t buf3;
  uint16_t connect_info;

  /* VBUS chattering cut */

  /* WAIT_LOOP */

  do
    {
      buf1 = ra6m5_usbdev_getreg16(RA6M5_USB_INTSTS0_OFFSET);
      up_udelay(10);
      buf2 = ra6m5_usbdev_getreg16(RA6M5_USB_INTSTS0_OFFSET);
      up_udelay(10);
      buf3 = ra6m5_usbdev_getreg16(RA6M5_USB_INTSTS0_OFFSET);
    }
  while (((buf1 & USB_VBSTS)  !=
          (buf2 & USB_VBSTS)) ||
         ((buf2 & USB_VBSTS)  !=
          (buf3 & USB_VBSTS)));

  if ((uint16_t)0 != (buf1 & USB_VBSTS))
    {
      /* Attach */

       connect_info = USB_ATTACH;
    }

  else
    {
      /* Detach */

      connect_info = USB_DETACH;
    }

  return connect_info;
}

/****************************************************************************
 * Name: hw_usb_read_dvstctr
 *
 * Description:
 *   Read DVSTCTR register
 *
 ****************************************************************************/

static uint16_t hw_usb_read_dvstctr(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_DVSTCTR0_OFFSET);

  return regval;
}

/****************************************************************************
 * Name: usb_cstd_port_speed
 *
 * Description:
 *   Set Port Speed for USB device
 *
 ****************************************************************************/

uint16_t usb_cstd_port_speed(void)
{
  uint16_t buf;
  uint16_t conn_inf;

  buf = hw_usb_read_dvstctr();

  /* Reset handshake status get */

  buf = (uint16_t)(buf & USB_RHST);

  switch (buf)
    {
      /* Get port speed */

      case USB_HSMODE:
        conn_inf = USB_HSCONNECT;
        break;
      case USB_FSMODE:
        conn_inf = USB_FSCONNECT;
        break;
      case USB_LSMODE:
        conn_inf = USB_LSCONNECT;
        break;
      case USB_HSPROC:
        conn_inf = USB_NOCONNECT;
        break;
      default:
        conn_inf = USB_NOCONNECT;
        break;
  }

  return conn_inf;
}

/****************************************************************************
 * Name: hw_usb_write_dcpcfg
 *
 * Description:
 *   Write to DCPCFG register
 *
 ****************************************************************************/

static void hw_usb_write_dcpcfg(uint16_t data)
{
  ra6m5_usbdev_putreg16(data, RA6M5_USB_DCPCFG_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_write_dcpmxps
 *
 * Description:
 *   Write to DCPMAXP register
 *
 ****************************************************************************/

static void hw_usb_write_dcpmxps(uint16_t data)
{
  ra6m5_usbdev_putreg16(data, RA6M5_USB_DCPMAXP_OFFSET);
}

/****************************************************************************
 * Name: usb_pstd_bus_reset
 *
 * Description:
 *   Bus Reset
 *
 ****************************************************************************/

void usb_pstd_bus_reset(void)
{
  struct ra6m5_usbdev_s *priv = &g_usbdev;
  priv->usbdev.speed = USB_SPEED_FULL;

  /* DCP configuration register  (0x5C) */

  hw_usb_write_dcpcfg(0);
  hw_usb_write_dcpmxps(USB_DCPMAXP);
}

/****************************************************************************
 * Name: hw_usb_pset_enb_rsme
 *
 * Description:
 *   Enable Resume Interrupt
 *
 ****************************************************************************/

void hw_usb_pset_enb_rsme(void)
{
  uint16_t regval;

