gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  regval = ra6m5_usbdev_getreg16(RA6M5_USB_INTENB0_OFFSET);
  regval |= USB_RSME;
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_INTENB0_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_read_syssts
 *
 * Description:
 *   Read System Status Register
 *
 ****************************************************************************/

static int hw_usb_read_syssts(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_SYSSTS0_OFFSET);

  return regval;
}

/****************************************************************************
 * Name: hw_usb_pclear_enb_rsme
 *
 * Description:
 *   Disable Resume Interrupt
 *
 ****************************************************************************/

void hw_usb_pclear_enb_rsme(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_INTENB0_OFFSET);
  regval &= (~USB_RSME);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_INTENB0_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_pclear_sts_resm
 *
 * Description:
 *   Clear Resume state
 *
 ****************************************************************************/

void hw_usb_pclear_sts_resm(void)
{
  uint16_t regval;
  regval = (uint16_t)(~USB_RESM);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_INTSTS0_OFFSET);
}

/****************************************************************************
 * Name: usb_pstd_suspend_process
 *
 * Description:
 *   Handle Suspend State of USB
 *
 ****************************************************************************/

void usb_pstd_suspend_process(void)
{
  /* Resume interrupt enable */

  hw_usb_pset_enb_rsme();
  hw_usb_pclear_sts_resm();

  /* RESM interrupt disable */

  hw_usb_pclear_enb_rsme();
}

/****************************************************************************
 * Name: hw_usb_pclear_sts_valid
 *
 * Description:
 *  Clear Valid Ststus bit
 *
 ****************************************************************************/

void hw_usb_pclear_sts_valid(void)
{
  uint16_t regval;
  regval = (uint16_t)~USB_VALID;
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_INTSTS0_OFFSET);
}

/****************************************************************************
 * Name: hw_usb_read_usbreq
 *
 * Description:
 *  Read USBREQ
 *
 ****************************************************************************/

uint16_t hw_usb_read_usbreq(void)
{
  uint16_t regval;
  regval = ra6m5_usbdev_getreg16(RA6M5_USB_USBREQ_OFFSET);
  return regval;
}

/****************************************************************************
 * Name: hw_usb_read_usbval
 *
 * Description:
 *  Read USBVAL
 *
 ****************************************************************************/

uint16_t hw_usb_read_usbval(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_USBVAL_OFFSET);

  return regval;
}

/****************************************************************************
 * Name: hw_usb_read_usbindx
 *
 * Description:
 *  Read USBINDX
 *
 ****************************************************************************/

uint16_t hw_usb_read_usbindx(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_USBINDX_OFFSET);

  return regval;
}

/****************************************************************************
 * Name: hw_usb_read_usbleng
 *
 * Description:
 *  Read USBLENG
 *
 ****************************************************************************/

uint16_t hw_usb_read_usbleng(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_USBLENG_OFFSET);

  return regval;
}

/****************************************************************************
 * Name: usb_pstd_save_request
 *
 * Description:
 *  Save the request
 *
 ****************************************************************************/

void usb_pstd_save_request(void)
{
  /* Valid clear */

  hw_usb_pclear_sts_valid();

  g_usb_pstd_req_type = hw_usb_read_usbreq();
  g_usb_pstd_req_value = hw_usb_read_usbval();
  g_usb_pstd_req_index = hw_usb_read_usbindx();
  g_usb_pstd_req_length = hw_usb_read_usbleng();
}

/****************************************************************************
 * Name: usb_pstd_set_stall
 *
 * Description:
 *  Set Stall status
 *
 ****************************************************************************/

void usb_pstd_set_stall(uint16_t pipe)
{
  /* PIPE control reg set */

  hw_usb_set_pid(pipe, USB_PID_STALL);
}

/****************************************************************************
 * Name: hw_usb_set_pid
 *
 * Description:
 *  Set PID
 *
 ****************************************************************************/

static void hw_usb_set_pid(uint16_t pipeno, uint16_t data)
{
  uint16_t *p_reg;

  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)ra6m5_usbdev_getreg_addr(RA6M5_USB_DCPCTR_OFFSET);
    }
  else
    {
      p_reg = (uint16_t *)ra6m5_usbdev_getreg_addr(RA6M5_USB_PIPE1CTR_OFFSET + ((pipeno - 1) * 2));
    }

  (*p_reg) &= (~USB_PID);
  (*p_reg) |= data;
}

/****************************************************************************
 * Name: hw_usb_pset_ccpl
 *
 * Description:
 *  Set CCPL
 *
 ****************************************************************************/

void hw_usb_pset_ccpl(void)
{
  uint16_t regval;

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_DCPCTR_OFFSET);
  regval |= USB_CCPL;
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_DCPCTR_OFFSET);
}

/****************************************************************************
 * Name: usb_pstd_ctrl_end
 *
 * Description:
 *  CTRL End
 *
 ****************************************************************************/

void usb_pstd_ctrl_end(uint16_t status)
{
  /* Interrupt disable */

  /* BEMP0 disable */

  hw_usb_clear_bempenb((uint16_t)USB_PIPE0);

  /* BRDY0 disable */

  hw_usb_clear_brdyenb((uint16_t)USB_PIPE0);

  /* NRDY0 disable */

  hw_usb_clear_nrdyenb((uint16_t)USB_PIPE0);

  hw_usb_set_mbw(USB_CUSE, USB_MBW_16);

