gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  if ((USB_DATA_ERR == status) || (USB_DATA_OVR == status))
    {
      /* Request error */

      usb_pstd_set_stall_pipe0();
    }

  else if (USB_DATA_STOP == status)
    {
      /* Pipe stop */

      usb_cstd_set_nak((uint16_t)USB_PIPE0);
    }

  else
    {
      /* Set CCPL bit */

      hw_usb_pset_ccpl();
    }
}

/****************************************************************************
 * Name: usb_pstd_set_feature3
 *
 * Description:
 *  Handles the set feature request
 *
 ****************************************************************************/

static void usb_pstd_set_feature3(void)
{
  uint16_t pipe;
  uint16_t ep;

  if (0 == g_usb_pstd_req_length)
    {
      /* check request type */

      switch ((g_usb_pstd_req_type & USB_BMREQUESTTYPERECIP))
        {
          case USB_DEVICE:
            switch (g_usb_pstd_req_value)
              {
                case USB_DEV_REMOTE_WAKEUP:
                  if (0 == g_usb_pstd_req_index)
                    {
                      /* Set pipe PID_BUF */

                      usb_cstd_set_buf((uint16_t)USB_PIPE0);
                    }
                  else
                    {
                      /* Not specification */

                      usb_pstd_set_stall_pipe0();
                    }
                  break;
                case USB_TEST_MODE:
                  if (USB_HSCONNECT == usb_cstd_port_speed())
                    {
                      if ((g_usb_pstd_req_index < USB_TEST_RESERVED) ||
                          (USB_TEST_VSTMODES <= g_usb_pstd_req_index))
                        {
                          g_usb_pstd_test_mode_flag = USB_TRUE;
                          g_usb_pstd_test_mode_select = g_usb_pstd_req_index;

                          /* Set pipe PID_BUF */

                          usb_cstd_set_buf((uint16_t)USB_PIPE0);
                        }
                      else
                        {
                          /* Not specification */

                          usb_pstd_set_stall_pipe0();
                        }
                    }
                  else
                    {
                      /* Not specification */

                      usb_pstd_set_stall_pipe0();
                    }
                  break;
                default:
                  usb_pstd_set_stall_pipe0();
                  break;
              }
            break;
          case USB_INTERFACE:

            /* Set pipe USB_PID_STALL */

            usb_pstd_set_stall_pipe0();
            break;
          case USB_ENDPOINT:

            /* Endpoint number */

            ep = (uint16_t)(g_usb_pstd_req_index & USB_EPNUMFIELD);
            if (USB_ENDPOINT_HALT == g_usb_pstd_req_value)
              {
                /* EP0 */

                if (0 == ep)
                  {
                    /* Set pipe PID_BUF */

                    usb_cstd_set_buf((uint16_t)USB_PIPE0);
                  }

                /* EP1 to max */

                else if (ep <= USB_MAX_EP_NO)
                  {
                    pipe = usb_pstd_epadr2pipe(g_usb_pstd_req_index);
                    if (USB_ERROR == pipe)
                      {
                        /* Request error */

                        usb_pstd_set_stall_pipe0();
                      }
                    else
                      {
                        /* Set pipe USB_PID_STALL */

                        usb_pstd_set_stall(pipe);

                        /* Set pipe PID_BUF */

                        usb_cstd_set_buf((uint16_t)USB_PIPE0);
                      }
                  }
                else
                  {
                    /* Request error */

                    usb_pstd_set_stall_pipe0();
                  }
              }
            else
              {
                /* Not specification */

                usb_pstd_set_stall_pipe0();
              }
            break;

          default:

            /* Request error */

            usb_pstd_set_stall_pipe0();
            break;
        }
    }
  else
    {
      /* Request error */

      usb_pstd_set_stall_pipe0();
    }
}

/****************************************************************************
 * Name: usb_pstd_clr_feature3
 *
 * Description:
 *  Handles the clear feature request
 *
 ****************************************************************************/

static void usb_pstd_clr_feature3(void)
{
  uint16_t pipe;
  uint16_t ep;

  if (0 == g_usb_pstd_req_length)
    {
      /* check request type */

      switch ((g_usb_pstd_req_type & USB_BMREQUESTTYPERECIP))
        {
           case USB_DEVICE:
             if ((USB_DEV_REMOTE_WAKEUP == g_usb_pstd_req_value)
                && (0 == g_usb_pstd_req_index))
               {
                 usb_cstd_set_buf((uint16_t)USB_PIPE0);
               }
             else
               {
                 /* Not specification */

                 usb_pstd_set_stall_pipe0();
               }
             break;
           case USB_INTERFACE:

            /* Request error */

            usb_pstd_set_stall_pipe0();
            break;

           case USB_ENDPOINT:

             /* Endpoint number */

             ep = (uint16_t)(g_usb_pstd_req_index & USB_EPNUMFIELD);
             if (USB_ENDPOINT_HALT == g_usb_pstd_req_value)
               {
                 /* EP0 */

                 if (0 == ep)
                   {
                     /* Stall clear */

                     usb_cstd_clr_stall((uint16_t)USB_PIPE0);

                     /* Set pipe PID_BUF */

                     usb_cstd_set_buf((uint16_t)USB_PIPE0);
                   }

                 /* EP1 to max */

                 else if (ep <= USB_MAX_EP_NO)
                   {
                     pipe = usb_pstd_epadr2pipe(g_usb_pstd_req_index);
                     if (USB_ERROR == pipe)
                       {
                         /* Request error */

                         usb_pstd_set_stall_pipe0();
                       }
                     else
                       {
                         if (USB_PID_BUF == usb_cstd_get_pid(pipe))
                           {
                             usb_cstd_set_nak(pipe);

                             /* SQCLR=1 */

                             hw_usb_set_sqclr(pipe);

                             /* Set pipe PID_BUF */

                             usb_cstd_set_buf(pipe);
                           }
                         else
                           {
                             usb_cstd_clr_stall(pipe);

                             /* SQCLR=1 */

                             hw_usb_set_sqclr(pipe);
                            }

                            /* Set pipe PID_BUF */

                            usb_cstd_set_buf((uint16_t)USB_PIPE0);
                            if (USB_TRUE == g_usb_pstd_stall_pipe[pipe])
                              {
                                g_usb_pstd_stall_pipe[pipe] = USB_FALSE;
                              }
                           }
                       }
                 else
                   {
                     /* Request error */

                     usb_pstd_set_stall_pipe0();
                   }
               }
             else
               {
                 /* Request error */

                 usb_pstd_set_stall_pipe0();
               }
             break;
           default:
             usb_pstd_set_stall_pipe0();
             break;
        }
    }
  else
    {
      /* Not specification */

      usb_pstd_set_stall_pipe0();
    }
}

/****************************************************************************
 * Name: usb_pstd_set_address3
 *
 * Description:
 *  Handles the Set Address request
 *
 ****************************************************************************/

static void usb_pstd_set_address3(void)
{
  if (USB_DEVICE == (g_usb_pstd_req_type & USB_BMREQUESTTYPERECIP))
    {
      if ((0 == g_usb_pstd_req_index) && (0 == g_usb_pstd_req_length))
        {
          if (g_usb_pstd_req_value <= 127)
            {
              /* Set pipe PID_BUF */

              usb_cstd_set_buf((uint16_t)USB_PIPE0);
            }
          else
            {
              /* Not specification */

              usb_pstd_set_stall_pipe0();
            }
        }
      else
        {
          /* Not specification */

          usb_pstd_set_stall_pipe0();
        }
    }
  else
    {
      /* Request error */

      usb_pstd_set_stall_pipe0();
    }
}

/****************************************************************************
 * Name: usb_pstd_stand_req3
 *
 * Description:
 *  Handle standard request
 *
 ****************************************************************************/

void usb_pstd_stand_req3(void)
{
  uint16_t regval;
  struct ra6m5_usbdev_s *priv = &g_usbdev;
  regval = MSBYTE(g_usb_pstd_req_type);

  switch (regval)
    {
      case USB_REQ_CLEARFEATURE:
        usb_pstd_clr_feature3();
        break;

      case USB_REQ_SETFEATURE:
        usb_pstd_set_feature3();
        break;

