gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
     case USB_REQ_SETADDRESS:
       usb_pstd_set_address3();
       break;

     case USB_REQ_SETCONFIGURATION:
       usb_cstd_set_buf((uint16_t)USB_PIPE0);      /* SetConfiguration3 */
       break;

     case USB_REQ_SETINTERFACE:
       /* Let the class implementation handle
        * as it requires access and updation of
        * Configuration descriptor
        */

       ra6m5_dispatchrequest(priv);
       break;

    default:
      break;
    }

  usb_pstd_ctrl_end((uint16_t)USB_CTRL_END); /* Control transfer stop(end) */
}

/****************************************************************************
 * Name: usb_pstd_stand_req4
 *
 * Description:
 *  Handle standard request
 *
 ****************************************************************************/

void usb_pstd_stand_req4(void)
{
  uint16_t regval;

  regval = MSBYTE(g_usb_pstd_req_type);
  switch (regval)
    {
      case USB_REQ_GETSTATUS:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* GetStatus4 */
        break;

      case USB_REQ_GETDESCRIPTOR:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* GetDescriptor4 */
        break;

      case USB_REQ_GETCONFIGURATION:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* GetConfiguration4 */
        break;

      case USB_REQ_GETINTERFACE:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* GetInterface4 */
        break;

      case USB_REQ_SYNCHFRAME:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* SynchFrame4 */
        break;

      default:
        break;
    }

  usb_pstd_ctrl_end((uint16_t)USB_CTRL_END);
}

/****************************************************************************
 * Name: usb_peri_class_request
 *
 * Description:
 *  Handle Class Request
 *
 ****************************************************************************/

void usb_peri_class_request(uint8_t type, uint16_t ctsq)
{
  if ((USB_CLASS == (type & USB_BMREQUESTTYPETYPE)) ||
      (USB_VENDOR == (type & USB_BMREQUESTTYPETYPE)))
    {
      switch (ctsq)
        {
          case USB_CS_IDST:
          case USB_CS_RDDS:
          case USB_CS_WRDS:

            /* Do Nothing */

            break;
          case USB_CS_WRND:
            usb_pstd_ctrl_end((uint16_t)USB_CTRL_END); /* class request (control write nodata status stage) */
            break;

          case USB_CS_RDSS:
            usb_cstd_set_buf((uint16_t)USB_PIPE0);
            usb_pstd_ctrl_end((uint16_t)USB_CTRL_END); /* class request (control read status stage) */
            break;

          case USB_CS_WRSS:
            usb_cstd_set_buf((uint16_t)USB_PIPE0);
            usb_pstd_ctrl_end((uint16_t)USB_CTRL_END); /* class request (control write status stage) */
            break;

          case USB_CS_SQER:
            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR); /* End control transfer. */
            break;

          default:
            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR); /* End control transfer. */
            break;
        }
    }
}

/****************************************************************************
 * Name: hw_usb_read_fifo16
 *
 * Description:
 *  Read FIFO16
 *
 ****************************************************************************/

static uint16_t hw_usb_read_fifo16(uint16_t pipemode)
{
  uint16_t data = 0;

  switch (pipemode)
    {
       case USB_CUSE:
         data = ra6m5_usbdev_getreg16(RA6M5_USB_CFIFO_OFFSET);
         break;

       default:
         break;
    }

  return data;
}

/****************************************************************************
 * Name: usb_pstd_read_fifo
 *
 * Description:
 *  Read FIFO
 *
 ****************************************************************************/

uint8_t *usb_pstd_read_fifo(uint16_t count, uint16_t pipemode,
                            uint8_t *read_p)
{
  uint16_t even;
  uint32_t odd_byte_data_temp;

  /* WAIT_LOOP */

  for (even = (uint16_t)(count >> 1); (0 != even); --even)
    {
      /* 16bit FIFO access */

      *(uint16_t *)read_p = hw_usb_read_fifo16(pipemode);

      /* Renewal read pointer */

      read_p += sizeof(uint16_t);
    }

  if ((count & (uint16_t)0x0001) != 0)
    {
      /* 16bit FIFO access */

      odd_byte_data_temp = hw_usb_read_fifo16(pipemode);

      *read_p = LSBYTE(odd_byte_data_temp);

      /* Renewal read pointer */

      read_p += sizeof(uint8_t);
    }

  return read_p;
}

/****************************************************************************
 * Name: usb_pstd_read_data
 *
 * Description:
 *  Read data
 *
 ****************************************************************************/

uint16_t usb_pstd_read_data(uint16_t pipe, uint16_t pipemode)
{
  uint16_t count;
  uint16_t buf;
  uint16_t mxps;
  uint16_t dtln;
  uint16_t end_flag;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_ERROR; /* Error */
    }

  /* Changes FIFO port by the pipe. */

  buf = usb_cstd_is_set_frdy(pipe, (uint16_t)pipemode, USB_FALSE);

  if (USB_ERROR == buf)
    {
      /* FIFO access error */

      return USB_ERROR;
    }

  dtln = (uint16_t)(buf & USB_DTLN);

  /* Max Packet Size */

  mxps = usb_cstd_get_maxpacket_size(pipe);

  g_usb_pstd_data_cnt[pipe] = RA6M5_MAXPACKET_SIZE;

  if (g_usb_pstd_data_cnt[pipe] < dtln)
    {
      /* Buffer Over ? */

      end_flag = USB_READOVER;

      /* Set NAK */

      usb_cstd_set_nak(pipe);
      count = (uint16_t)g_usb_pstd_data_cnt[pipe];
      g_usb_pstd_data_cnt[pipe] = dtln;
    }
  else if (g_usb_pstd_data_cnt[pipe] == dtln)
    {
      /* Just Receive Size */

      count = dtln;
      if ((USB_PIPE0 == pipe) && (0 == (dtln % mxps)))
        {
          /* Just Receive Size */

          /* Peripheral Function */

          end_flag = USB_READING;
        }
      else
        {
          end_flag = USB_READEND;

          /* Set NAK */

          usb_cstd_set_nak(pipe);
        }
    }
  else
    {
      /* Continuous Receive data */

      count = dtln;
      end_flag = USB_READING;
      if (0 == count)
        {
          /* Null Packet receive */

          end_flag = USB_READSHRT;

          /* Select NAK */

          usb_cstd_set_nak(pipe);
        }

      if (0 != (count % mxps))
        {
          /* Null Packet receive */

          end_flag = USB_READSHRT;

          /* Select NAK */

          usb_cstd_set_nak(pipe);
        }
    }

  if (0 == dtln)
    {
      /* 0 length packet */

