gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
      /* Clear BVAL */

      hw_usb_set_bclr(pipemode);
    }
  else
    {
      gp_usb_pstd_data[2] = g_buffer;
      gp_usb_pstd_data[pipe] = usb_pstd_read_fifo(count, pipemode,
                                                  gp_usb_pstd_data[pipe]);
    }

  g_usb_pstd_data_cnt[pipe] -= count;

  /* End or Err or Continue */

  return end_flag;
}

/****************************************************************************
 * Name: usb_pstd_fifo_to_buf
 *
 * Description:
 *  FIFO to BUF
 *
 ****************************************************************************/

void usb_pstd_fifo_to_buf(uint16_t pipe, uint16_t useport)
{
  uint16_t end_flag;

  end_flag = USB_ERROR;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  end_flag = usb_pstd_read_data(pipe, useport);

  /* Check FIFO access sequence */

  switch (end_flag)
    {
      case USB_READING:

        /* Continue of data read */

        break;

        case USB_READEND:

        /* End of data read */

        usb_pstd_data_end(pipe, (uint16_t)USB_DATA_OK);
        break;

      case USB_READSHRT:

        /* End of data read */

        usb_pstd_data_end(pipe, (uint16_t)USB_DATA_SHT);
        break;

      case USB_READOVER:

        /* Buffer over */

        usb_pstd_forced_termination(pipe, (uint16_t)USB_DATA_OVR);
        break;

      case USB_ERROR:

        /* FIFO access error */

        usb_pstd_forced_termination(pipe, (uint16_t)USB_DATA_ERR);
        break;

      default:
        usb_pstd_forced_termination(pipe, (uint16_t)USB_DATA_ERR);
        break;
   }
}

/****************************************************************************
 * Name: usb_pstd_brdy_pipe_process
 *
 * Description:
 *  Handle BRDY Pipe for Data
 *
 ****************************************************************************/

void usb_pstd_brdy_pipe_process(uint16_t bitsts)
{
  uint16_t useport;
  uint16_t i;

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i <= USB_MAX_PIPE_NO; i++)
    {
      if (0u != (bitsts & USB_BITSET(i)))
        {
          /* Interrupt check */

          hw_usb_clear_sts_brdy(i);
          hw_usb_clear_status_bemp(i);

          if (USB_NULLPTR != g_p_usb_pstd_pipe[i])
            {
              /* Pipe number to FIFO port select */

              useport = usb_pstd_pipe2fport(i);

              if (USB_CUSE == useport)
                {
                  if (USB_BUF2FIFO == usb_cstd_get_pipe_dir(i))
                    {
                      /* Buffer to FIFO data write */

                      usb_pstd_buf_to_fifo(i, useport);
                    }
                  else
                    {
                      /* FIFO to Buffer data read */

                     usb_pstd_fifo_to_buf(i, useport);
                    }
                }
            }
        }
    }
}

/****************************************************************************
 * Name: usb_pstd_brdy_pipe
 *
 * Description:
 *  Handle BRDY Interrupt
 *
 ****************************************************************************/

void usb_pstd_brdy_pipe(uint16_t bitsts, struct ra6m5_usbdev_s *priv,
                        struct ra6m5_ep_s *privep, uint16_t epno)
{
  uint32_t nbytes;

  if (USB_BRDY0 == (ra6m5_usbdev_getreg16(RA6M5_USB_BRDYSTS_OFFSET) & USB_BRDY0))
    {
      hw_usb_clear_sts_brdy(USB_PIPE0);
      g_usb_pstd_data_cnt[0] = CDC_CLASS_DATA_LENGTH;

      switch (usb_pstd_read_data(USB_PIPE0, USB_CUSE))
        {
          /* End of data read */

          case USB_READEND:

            /* Continue */

            /* End of data read */

          case USB_READSHRT:
            hw_usb_clear_brdyenb((uint16_t)USB_PIPE0);
            break;

            /* Continue of data read */

          case USB_READING:

            /* PID = BUF */

            usb_cstd_set_buf((uint16_t)USB_PIPE0);
            break;

            /* FIFO access error */

          case USB_READOVER:

            /* Clear BVAL */

            hw_usb_set_bclr(USB_CUSE);

            /* Control transfer stop(end) */

            usb_pstd_ctrl_end((uint16_t)USB_DATA_OVR);
            break;

            /* FIFO access error */

          case USB_ERROR:

            /* Control transfer stop(end) */

            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR);
            break;
          default:
            break;
        }
    }
  else
    {
      /* not PIPE0 */

      usb_pstd_brdy_pipe_process(bitsts);
      epno = BULK_IN_EPNUM;
      nbytes = USB_DCPMAXP - g_usb_pstd_data_cnt[BULK_OUT_PIPE];
      usb_data_write(epno, g_buffer, nbytes);
      ra6m5_usbdev_putreg16(0, RA6M5_USB_BRDYSTS_OFFSET);
      privep->head->req.buf = g_buffer;

      /* EP3 is passed, because for read(),
       * the endpoint list should
       * always point to bulk out endpoint
       */

      privep = &priv->eplist[EP3];
      usb_data_read(g_buffer, RA6M5_MAXPACKET_SIZE);
      bytesread = nbytes;

      /* The ra6m5_rdrequest() function is invoked here
       * to handle application specific read()
       * and invoke the reqcomplete() function
       * which further, unblocks the semaphore waiting
       * on read()
       * Failing to invoke this function will result,
       * in failiure of application specific read
       *
       */

      ra6m5_rdrequest(epno, priv, privep);
      bytesread = 0;
    }
}

/****************************************************************************
 * Name: usb_cstd_get_pid
 *
 * Description:
 *  Get PID
 *
 ****************************************************************************/

static uint16_t usb_cstd_get_pid(uint16_t pipe)
{
  uint16_t buf;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_NULL; /* Error */
    }

  /* PIPE control reg read */

  buf = hw_usb_read_pipectr(pipe);
  return (uint16_t)(buf & USB_PID);
}

/****************************************************************************
 * Name: usb_pstd_bemp_pipe_process
 *
 * Description:
 *  BEMP Interrupt Handling for Pipe
 *
 ****************************************************************************/

void usb_pstd_bemp_pipe_process(uint16_t bitsts)
{
  uint16_t buf;
  uint16_t i;

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i <= USB_PIPE5; i++)
    {
      if (0 != (bitsts & USB_BITSET(i)))
        {
          hw_usb_clear_status_bemp(i);

          /* Interrupt check */

          if ((USB_NULLPTR != g_p_usb_pstd_pipe[i]))
            {
              buf = usb_cstd_get_pid(i);

              /* MAX packet size error ? */

              if (USB_PID_STALL == (buf & USB_PID_STALL))
                {
                   usb_pstd_forced_termination(i, (uint16_t)USB_DATA_STALL);
                }
              else
                {
                  if (USB_INBUFM != (hw_usb_read_pipectr(i) & USB_INBUFM))
                    {
                      usb_pstd_data_end(i, (uint16_t)USB_DATA_NONE);
                    }
                  else
                    {
                      /* set BEMP enable */

                      hw_usb_set_bempenb(i);
                    }
                }
            }
        }
    }

  /* WAIT_LOOP */

  for (i = USB_PIPE6; i <= USB_MAX_PIPE_NO; i++)
    {
      /* Interrupt check */

