gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
      if (0 != (bitsts & USB_BITSET(i)))
        {
          if (USB_NULLPTR != g_p_usb_pstd_pipe[i])
            {
              buf = usb_cstd_get_pid(i);

              /* MAX packet size error ? */

              if (USB_PID_STALL == (buf & USB_PID_STALL))
                {
                  usb_pstd_forced_termination(i, (uint16_t)USB_DATA_STALL);
                }
              else
                {
                  /* End of data transfer */

                  usb_pstd_data_end(i, (uint16_t)USB_DATA_NONE);
                }
            }
        }
    }
}

/****************************************************************************
 * Name: usb_pstd_bemp_pipe
 *
 * Description:
 *  BEMP Interrupt Handling
 *
 ****************************************************************************/

void usb_pstd_bemp_pipe(uint16_t bitsts)
{
  if (USB_BEMP0 == (bitsts & USB_BEMP0))
    {
      switch (usb_pstd_write_data(USB_PIPE0, USB_CUSE))
        {
          /* End of data write (not null) */

          case USB_WRITEEND:

            /* Continue */

            /* End of data write */

          case USB_WRITESHRT:

            /* Enable empty interrupt */

            hw_usb_clear_bempenb((uint16_t)USB_PIPE0);
            break;

            /* Continue of data write */

          case USB_WRITING:

            /* PID = BUF */

            usb_cstd_set_buf((uint16_t)USB_PIPE0);
            break;

            /* FIFO access error */

          case USB_ERROR:

            /* Control transfer stop(end) */

            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR);
            break;

          default:
            break;
        }
    }
  else
    {
      /* BEMP interrupt */

      usb_pstd_bemp_pipe_process(bitsts);
    }
}

/****************************************************************************
 * Name: hw_usb_read_frmnum
 *
 * Description:
 *  Read Framenum
 *
 ****************************************************************************/

static uint16_t hw_usb_read_frmnum(void)
{
  return ra6m5_usbdev_getreg16(RA6M5_USB_FRMNUM_OFFSET);
}

/****************************************************************************
 * Name: usb_pstd_nrdy_pipe_process
 *
 * Description:
 *  NRDY Pipe Prrocess
 *
 ****************************************************************************/

void usb_pstd_nrdy_pipe_process(uint16_t bitsts)
{
  uint16_t buf;
  uint16_t i;

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i <= USB_MAX_PIPE_NO; i++)
    {
      if (0 != (bitsts & USB_BITSET(i)))
        {
          /* Interrupt check */

          if (USB_NULLPTR != g_p_usb_pstd_pipe[i])
            {
              if (USB_TYPFIELD_ISO == usb_cstd_get_pipe_type(i))
                {
                  /* Wait for About 60ns */

                  buf = hw_usb_read_frmnum();
                  if (USB_OVRN == (buf & USB_OVRN))
                    {
                      /* @1 */

                      /* End of data transfer */

                      usb_pstd_forced_termination(i, (uint16_t)USB_DATA_OVR);
                    }
                  else
                    {
                      /* @2 */

                      /* End of data transfer */

                      usb_pstd_forced_termination(i, (uint16_t)USB_DATA_ERR);
                    }
                }
              else
                {
                  /* Non processing. */
                }
            }
        }
    }
}

/****************************************************************************
 * Name: ra6m5_usbdev_bottomhalf
 *
 * Description:
 *  BRDY handler in bottom half
 *
 ****************************************************************************/

static void ra6m5_usbdev_bottomhalf(void *arg)
{
  struct ra6m5_usbdev_s *priv = &g_usbdev;
  uint32_t bottom_half_processing = (uint32_t)arg;
  struct ra6m5_ep_s *privep;

  if (bottom_half_processing == USB_INT_BRDY)
    {
      uint16_t regval;
      uint8_t epno;
      uint16_t brdysts;

      brdysts = ra6m5_usbdev_getreg16(RA6M5_USB_BRDYSTS_OFFSET);
      regval = ra6m5_usbdev_getreg16(RA6M5_USB_PIPECFG_OFFSET);
      regval &= USB_EPNUMFIELD;
      epno = regval;
      privep =  &priv->eplist[epno];
      usb_pstd_brdy_pipe(brdysts, priv, privep, epno);
    }
}

/****************************************************************************
 * Name: usb_pstd_nrdy_pipe
 *
 * Description:
 *  NRDY Interrupt handler
 *
 ****************************************************************************/

void usb_pstd_nrdy_pipe(uint16_t bitsts)
{
  /* Nrdy Pipe interrupt */

  usb_pstd_nrdy_pipe_process(bitsts);
}

/****************************************************************************
 * Name: ra6m5_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int ra6m5_usbinterrupt(int irq, void *context, void *arg)
{
  struct ra6m5_usbdev_s *priv = &g_usbdev;

  uint8_t type;
  uint16_t ists0;
  uint16_t intenb0;
  uint16_t intsts0;
  uint16_t stginfo;
  uint16_t bempsts;
  uint16_t nrdysts;
  static uint32_t connected_times = 0;

  intenb0 = ra6m5_usbdev_getreg16(RA6M5_USB_INTENB0_OFFSET);

  /* Read Interrupt Status and mask out interrupts that are not enabled. */

  intsts0 = ra6m5_usbdev_getreg16(RA6M5_USB_INTSTS0_OFFSET) & intenb0;
  nrdysts = ra6m5_usbdev_getreg16(RA6M5_USB_NRDYSTS_OFFSET);
  bempsts = ra6m5_usbdev_getreg16(RA6M5_USB_BEMPSTS_OFFSET);

  /* Check VBUS */

  if ((intsts0 & USB_VBINT) == USB_VBINT)
    {
      ra6m5_usbdev_putreg16(
          ((~USB_VBINT) & INTSTS0_BIT_VALUES_TO_DETECT),
          RA6M5_USB_INTSTS0_OFFSET);

      if (USB_ATTACH == usb_pstd_chk_vbsts())
        {
          priv->attached = 1;
          connected_times++;
          syslog(LOG_INFO, "NuttX: USB Device Connected. %ld\n",
                 connected_times);
          uinfo("Device attached\n");
          usb_pstd_attach_process(); /* USB attach */
        }
      else
        {
          priv->attached = 0;
          syslog(LOG_INFO, "NuttX: USB Device Disconnected. %ld\n",
                 connected_times);
          usb_pstd_detach_process(); /* USB detach */
          if (priv->driver)
            {
              CLASS_DISCONNECT(priv->driver, &priv->usbdev);
            }
        }
    }

