gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  intsts0 = ra6m5_usbdev_getreg16(RA6M5_USB_INTSTS0_OFFSET);
  if ((intsts0 & USB_DVST) == USB_DVST)
    {
      ra6m5_usbdev_putreg16(
          ((~USB_DVST) & INTSTS0_BIT_VALUES_TO_DETECT),
          RA6M5_USB_INTSTS0_OFFSET);

      switch ((uint16_t)(intsts0 & USB_DVSQ))
        {
          /* Power state  */

          case USB_DS_POWR:
            break;

            /* Default state  */

          case USB_DS_DFLT:
            uinfo("USB-reset int peri\n");
            usb_pstd_bus_reset();
            break;

            /* Address state  */

          case USB_DS_ADDS:
            break;

            /* Configured state  */

          case USB_DS_CNFG:
            uinfo("Device configuration int peri\n");
            break;

            /* Power suspend state */

          case USB_DS_SPD_POWR:

            /* Continue */

            /* Default suspend state */

          case USB_DS_SPD_DFLT:

            /* Continue */

            /* Address suspend state */

          case USB_DS_SPD_ADDR:

            /* Continue */

            /* Configured Suspend state */

          case USB_DS_SPD_CNFG:
            uinfo("SUSPEND int peri\n");
            usb_pstd_suspend_process();
            break;

            /* Error */

          default:
            break;
        }
    }

  intsts0 = ra6m5_usbdev_getreg16(RA6M5_USB_INTSTS0_OFFSET);
  if ((intsts0 & USB_CTRT) == USB_CTRT)
    {
      ra6m5_usbdev_putreg16
        (((~USB_CTRT) & INTSTS0_BIT_VALUES_TO_DETECT),
                     RA6M5_USB_INTSTS0_OFFSET);

      stginfo = (uint16_t)(ra6m5_usbdev_getreg16(RA6M5_USB_INTSTS0_OFFSET) & USB_CTSQ);

      if (((USB_CS_RDDS == stginfo) || (USB_CS_WRDS == stginfo))
          || (USB_CS_WRND == stginfo))
        {
          /* Save request register */

          usb_pstd_save_request();
        }

      if (USB_REQ_TYPE_STANDARD ==
          (g_usb_pstd_req_type & USB_BMREQUESTTYPETYPE))
        {
          /* Switch on the control transfer stage (CTSQ). */

          switch (stginfo)
            {
              /* Idle or setup stage */

              uinfo("stginfo =%d\n", stginfo);
              case USB_CS_IDST:
              case USB_CS_RDDS:
              case USB_CS_WRDS:
              case USB_CS_WRSS:

                ra6m5_ep0setup(priv);
                break;

              case USB_CS_RDSS:
                usb_pstd_stand_req4();
                break;

              case USB_CS_WRND:
                usb_pstd_stand_req3();
                break;

              /* Control sequence error */

              case USB_CS_SQER:
                usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR);
                break;

            /* Illegal */

          default:
            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR);
            break;
          }
      }
    else
      {
        /* Vender Specific */

        type = LSBYTE(ra6m5_usbdev_getreg16(RA6M5_USB_USBREQ_OFFSET));
        ra6m5_ep0setup(priv);
        usb_peri_class_request(type, stginfo);
      }
  }

  ists0 = (uint16_t)(intsts0 & intenb0);

  /* BRDY Interrupt Check */

  if (USB_BRDY == (ists0 & USB_BRDY))
    {
      DEBUGVERIFY(work_queue(HPWORK, &g_usbdev.ra6m5_interrupt_bhalf,
                             ra6m5_usbdev_bottomhalf,
                             (void *)USB_INT_BRDY, 0));
    }

  /* BEMP Interrupt Check */

  if ((USB_BEMP == (ists0 & USB_BEMP)))
    {
      usb_pstd_bemp_pipe_process(bempsts);
    }

  /* NRDY Interrupt Check */

  if ((((intsts0 & intenb0) & USB_NRDY)) == USB_NRDY)
    {
      usb_pstd_nrdy_pipe(nrdysts);
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: arm_usbinitialize
 *
 * Description:
 *   Initialize USB hardware
 *
 ****************************************************************************/

void arm_usbinitialize(void)
{
  /* For now there is only one USB controller, but we will always refer to
   * it using a pointer
   */

  struct ra6m5_usbdev_s *priv = &g_usbdev;
  uint16_t regval;
  int epno, ret=0;
  usbtrace(TRACE_DEVINIT, 0);

  /* Enable write to System registers */

  putreg16((BSP_PRV_PRCR_KEY) | 0x0bU, RA6M5_SYSTEM_REG(RA6M5_SYS_PRCR_OFFSET));


  /* Clear bit 11 - so that USB module is released from stop state */

  modifyreg32(RA6M5_MSTP_REG(RA6M5_MSTP_MSTPCRB_OFFSET), MSTP_MSTPCRB_USBFS, 0);

  memset(priv, 0, sizeof(struct ra6m5_usbdev_s));
  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->eplist[EP0].ep;
  priv->epavail    = RA6M5_ENDP_ALLSET & ~RA6M5_ENDP_BIT(EP0);

  /* Initialize the endpoint list */

  for (epno = 0; epno < RA6M5_NENDPOINTS; epno++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the (physical) endpoint number which is just the index to the
       * endpoint.
       */

      priv->eplist[epno].ep.ops   = &g_epops;
      priv->eplist[epno].dev      = priv;
      priv->eplist[epno].ep.eplog = epno;

      /* We will use a fixed maxpacket size for all endpoints (perhaps
       * ISOC endpoints could have larger maxpacket???).  A smaller
       * packet size can be selected when the endpoint is configured.
       */

      priv->eplist[epno].ep.maxpacket = RA6M5_MAXPACKET_SIZE;
    }

  /* Select a smaller endpoint size for EP0 */

#if RA6M5_EP0MAXPACKET < RA6M5_MAXPACKET_SIZE
  priv->eplist[EP0].ep.maxpacket = RA6M5_EP0MAXPACKET;
#endif

  /* Set SCKE bit in SYSCFG Register */

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_SYSCFG_OFFSET);
  regval |= (USB_SCKE);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_SYSCFG_OFFSET);

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_PHYSLEW_OFFSET);
  regval |= (USB_SLEWR00 | USB_SLEWF00);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_PHYSLEW_OFFSET);

  /* Set USBE bit in SYSCFG register */

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_SYSCFG_OFFSET);
  regval |= (USB_USBE);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_SYSCFG_OFFSET);

  /* Set MBW bit in CFIFOSEL register */

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_CFIFOSEL_OFFSET);
  regval |= (USB_MBW_16);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_CFIFOSEL_OFFSET);

  /* Set MBW bit in D0FIFOSEL register */

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_D0FIFOSEL_OFFSET);
  regval |= (USB_MBW_16);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_D0FIFOSEL_OFFSET);

  /* Set MBW bit in D1FIFOSEL register */

