gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_usbdev.c
  regval = ra6m5_usbdev_getreg16(RA6M5_USB_D1FIFOSEL_OFFSET);
  regval |= (USB_MBW_16);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_D1FIFOSEL_OFFSET);

  /* Set the Interrupt enable bits in INTENB0 register */

  regval = ra6m5_usbdev_getreg16(RA6M5_USB_INTENB0_OFFSET);
  regval |= (USB_BEMPE | USB_BRDYE |
             USB_VBSE  | USB_DVSE  |
             USB_CTRE);
  ra6m5_usbdev_putreg16(regval, RA6M5_USB_INTENB0_OFFSET);

  ret += irq_attach(RA6M5_IRQ_USBFS_INT, ra6m5_usbinterrupt, NULL);
  ret += irq_attach(RA6M5_IRQ_USBFS_RSM, ra6m5_usbinterrupt, NULL);
  if (ret != 0)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_IRQREGISTRATION),
               (uint16_t)RA6M5_IRQ_USBFS_INT);
    }

  priv->usbdev.speed = USB_SPEED_FULL;

  syslog(LOG_INFO, "Debug:USB Device Initialized, Device connected:%s\n",
         priv->attached ? "YES" : "NO");
}

/****************************************************************************
 * Name: arm_usbuninitialize
 * Description:
 *   Initialize the USB driver
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void arm_usbuninitialize(void)
{
  struct ra6m5_usbdev_s *priv = &g_usbdev;

  usbtrace(TRACE_DEVUNINIT, 0);
  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_DRIVERREGISTERED), 0);
      usbdev_unregister(priv->driver);
    }

  priv->usbdev.speed = USB_SPEED_UNKNOWN;

  /* Disable and detach IRQs */

  up_disable_irq(RA6M5_IRQ_USBFS_INT);
  up_disable_irq(RA6M5_IRQ_USBFS_RSM);
#ifdef CONFIG_USBDEV_DMA
  up_disable_irq(RA6M5_IRQ_USBFS_FIFO0);
  up_disable_irq(RA6M5_IRQ_USBFS_FIFO1);
#endif

  irq_detach(RA6M5_IRQ_USBFS_INT);
  irq_detach(RA6M5_IRQ_USBFS_RSM);
#ifdef CONFIG_USBDEV_DMA
  irq_detach(RA6M5_IRQ_USBFS_FIFO0);
  irq_detach(RA6M5_IRQ_USBFS_FIFO1);
#endif
}

/****************************************************************************
 * Name: usbdevclass_register
 *
 * Description:
 *   Register a USB device class driver. The class driver's
 *   bind() method will be
 *   called to bind it to a USB device driver.
 *
 ****************************************************************************/

int usbdev_register(struct usbdevclass_driver_s *driver)
{
  int ret;

  usbtrace(TRACE_DEVREGISTER, 0);

#ifdef CONFIG_DEBUG_USB
  if (!driver || !driver->ops->bind || !driver->ops->unbind ||
      !driver->ops->disconnect || !driver->ops->setup)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }

  if (g_usbdev.driver)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_DRIVER), 0);
      return -EBUSY;
    }
#endif

  /* First hook up the driver */

  g_usbdev.driver = driver;

  /* Then bind the class driver */

  ret = CLASS_BIND(driver, &g_usbdev.usbdev);
  if (ret)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_BINDFAILED), (uint16_t)-ret);
      g_usbdev.driver = NULL;
    }
  else
    {
      /* Enable USB controller interrupts */

      up_enable_irq(RA6M5_IRQ_USBFS_INT);
      up_enable_irq(RA6M5_IRQ_USBFS_RSM);

      #ifdef CONFIG_USBDEV_DMA
      up_enable_irq(RA6M5_IRQ_USBFS_FIFO0);
      up_enable_irq(RA6M5_IRQ_USBFS_FIFO1);
      #endif
    }

  return ret;
}

/****************************************************************************
 * Name: usbdev_unregister
 *
 * Description:
 *   Un-register usbdev class driver.If the USB device is connected
 *   to a USB host, it will first disconnect().  The driver is
 *   also requested to unbind() and clean
 *   up any device state, before this procedure finally returns.
 *
 ****************************************************************************/

int usbdev_unregister(struct usbdevclass_driver_s *driver)
{
  usbtrace(TRACE_DEVUNREGISTER, 0);

#ifdef CONFIG_DEBUG_FEATURES
  if (driver != g_usbdev.driver)
    {
      usbtrace(TRACE_DEVERROR(RA6M5_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Unbind the class driver */

  CLASS_UNBIND(driver, &g_usbdev.usbdev);

  /* Disable IRQs */

  up_disable_irq(RA6M5_IRQ_USBFS_INT);
  up_disable_irq(RA6M5_IRQ_USBFS_RSM);
#ifdef CONFIG_USBDEV_DMA
  up_disable_irq(RA6M5_IRQ_USBFS_FIFO0);
  up_disable_irq(RA6M5_IRQ_USBFS_FIFO1);
#endif

  /* Unhook the driver */

  g_usbdev.driver = NULL;
  return OK;
}
